&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаСтраницы = Элементы.Найти("ГруппаСтраницы");
	
	СтраницаБригады = Элементы.Добавить("ТДФ1_ГруппаБригады", Тип("ГруппаФормы"), ГруппаСтраницы);
	СтраницаБригады.Вид = ВидГруппыФормы.Страница;
	СтраницаБригады.ОтображатьЗаголовок = Истина;
	СтраницаБригады.Заголовок = "Бригады";
	
	ПоляФормы = Новый Массив;
	
	ТабличноеПолеПроверил = Элементы.Добавить("ax_Проверил", Тип("ПолеФормы"), СтраницаБригады);
	ТабличноеПолеПроверил.ПутьКДанным = "Объект.ax_Проверил";
	ТабличноеПолеПроверил.Видимость = Истина;
	ТабличноеПолеПроверил.Вид = ВидПоляФормы.ПолеВвода;
	ТабличноеПолеПроверил.Заголовок = "Проверил"; 
	ТабличноеПолеПроверил.РежимВыбораИзСписка = Истина;
	ТабличноеПолеПроверил.КнопкаСоздания = Ложь;
	ТабличноеПолеПроверил.УстановитьДействие("ПриИзменении", "ПроверилПриИзменении");
	ПоляФормы.Добавить(ТабличноеПолеПроверил);
	
	ТабличноеПолеОтгрузил = Элементы.Добавить("ax_Отгрузил", Тип("ПолеФормы"), СтраницаБригады);
	ТабличноеПолеОтгрузил.ПутьКДанным = "Объект.ax_Отгрузил";
	ТабличноеПолеОтгрузил.Видимость = Истина;
	ТабличноеПолеОтгрузил.Вид = ВидПоляФормы.ПолеВвода;
	ТабличноеПолеОтгрузил.Заголовок = "Отгрузил";
	ТабличноеПолеОтгрузил.РежимВыбораИзСписка = Истина;
	ТабличноеПолеОтгрузил.КнопкаСоздания = Ложь;
	ТабличноеПолеОтгрузил.УстановитьДействие("ПриИзменении", "ОтгрузилПриИзменении");
	ПоляФормы.Добавить(ТабличноеПолеОтгрузил);
	
	ax_АдаптацияИнтерфейса.ИнициализироватьСписокВыбораПолейФормы(ПоляФормы);
	
	ЭлементСтраницаОсновное = Элементы.Найти("СтраницаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная", Тип("ГруппаФормы"), ЭлементСтраницаОсновное );
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
		
	ЭлементУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементУС.Видимость = Истина;
	ЭлементУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементУС.Заголовок = "Отправить в УС";
	ЭлементУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементОтправитьВУСНепроведенным = Элементы
		.Добавить("ax_ОтправитьВУСНепроведенным", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементОтправитьВУСНепроведенным.ПутьКДанным = "Объект.ax_ОтправитьВУСНепроведенным";
	ЭлементОтправитьВУСНепроведенным.Видимость = Истина;
	ЭлементОтправитьВУСНепроведенным.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементОтправитьВУСНепроведенным.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементОтправитьВУСНепроведенным.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементОтправитьВУСНепроведенным.Заголовок = "Отправить в УС непроведенным";
	ЭлементОтправитьВУСНепроведенным.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементПроверенСкладом = Элементы
		.Добавить("ax_ПроверенСкладом", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементПроверенСкладом.ПутьКДанным = "Объект.ax_ПроверенСкладом";
	ЭлементПроверенСкладом.Видимость = Истина;
	ЭлементПроверенСкладом.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементПроверенСкладом.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.Заголовок = "Проверен складом";
	ЭлементПроверенСкладом.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементКомментарийСклад = Элементы
		.Добавить("ax_КомментарийСклад", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементКомментарийСклад.ПутьКДанным = "Объект.ax_КомментарийСклад";
	ЭлементКомментарийСклад.Видимость = Истина;
	ЭлементКомментарийСклад.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКомментарийСклад.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.Заголовок = "Комментарий для склада";
	ЭлементКомментарийСклад.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх; 
	ЭлементКомментарийСклад.РастягиватьПоГоризонтали = Истина;
	ЭлементКомментарийСклад.МногострочныйРежим = Истина;
	ЭлементКомментарийСклад.Ширина = 76;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверилПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ax_Проверил) Тогда
		ПроверилПриИзмененииСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузилПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ax_Отгрузил) Тогда		
		ОтгрузилПриИзмененииСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверилПриИзмененииСервер()
	УстановитьЗначенияРеквизитовФормы(
		"Объект", 
		Новый Структура( "ax_ПроверилДата", ТекущаяДатаСеанса()), 
		Тип("ДокументОбъект.ПеремещениеТоваров"));
КонецПроцедуры

&НаСервере
Процедура ОтгрузилПриИзмененииСервер()
	УстановитьЗначенияРеквизитовФормы(
		"Объект", 
		Новый Структура( "ax_ОтгрузилДата", ТекущаяДатаСеанса()), 
		Тип("ДокументОбъект.ПеремещениеТоваров"));
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияРеквизитовФормы(ИмяРеквизитаФормы, Значения, ТипЗначения = Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение(ИмяРеквизитаФормы,  ТипЗначения);
	ОбщегоНазначения.УстановитьЗначенияРеквизитов(ДокументОбъект, Значения);
	ЗначениеВРеквизитФормы(ДокументОбъект, ИмяРеквизитаФормы);
	
КонецПроцедуры
