
&После("ПередЗаписью")
Процедура ax_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	СсылкаРасхождения = Ссылка.Расхождения.Выгрузить();
	
	Для Каждого СтрокаРасхождения Из Расхождения Цикл 				
		 СтрокаСсылкаРасхождения = СсылкаРасхождения.Найти(СтрокаРасхождения.Номенклатура, "Номенклатура");
		Если СтрокаСсылкаРасхождения <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(СтрокаРасхождения, СтрокаСсылкаРасхождения, "ax_КодСтроки");	
		КонецЕсли;
	КонецЦикла;
		
	ОбменДаннымиWMS4.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Расхождения");
	
КонецПроцедуры
