
&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ТекущийСписокДокументыПродажи = ЭтаФорма["СписокДокументыПродажи"];
	//
	//ТекущийСписокДокументыПродажи.ТекстЗапроса = "ВЫБРАТЬ
	//|	РеестрДокументовПереопределяемый.Ссылка КАК Ссылка,
	//|	ЕСТЬNULL(ax_СкладскойОрдер.усСтатусДокумента, ЗНАЧЕНИЕ(Перечисление.усСтатусыДокументов.Новый)) КАК усСтатусДокумента,
	//|	РеестрДокументовПереопределяемый.НомерДокументаИБ КАК Номер,
	//|	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	//|	РеестрДокументовПереопределяемый.Статус КАК Статус,
	//|	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	//|	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	//|	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	//|	РеестрДокументовПереопределяемый.Партнер КАК Партнер,
	//|	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Контрагент.Ключ КАК Справочник.Контрагенты) КАК Контрагент,
	//|	РеестрДокументовПереопределяемый.Контрагент КАК КонтрагентКлюч,
	//|	РеестрДокументовПереопределяемый.Договор КАК Договор,
	//|	РеестрДокументовПереопределяемый.Организация КАК Организация,
	//|	РеестрДокументовПереопределяемый.Подразделение КАК Подразделение,
	//|	РеестрДокументовПереопределяемый.МестоХранения КАК МестоХранения,
	//|	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.Склады) КАК Склад,
	//|	РеестрДокументовПереопределяемый.Валюта КАК Валюта,
	//|	РеестрДокументовПереопределяемый.Сумма КАК СуммаДокумента,
	//|	РеестрДокументовПереопределяемый.Ответственный КАК Менеджер,
	//|	РеестрДокументовПереопределяемый.Автор КАК Автор,
	//|	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	//|	РеестрДокументовПереопределяемый.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	//|	РеестрДокументовПереопределяемый.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	//|	РеестрДокументовПереопределяемый.Дополнительно КАК Дополнительно,
	//|	СостоянияЭДПереопределяемый.СостояниеЭДО КАК СостояниеВерсииЭД,
	//|	СостоянияЭДПереопределяемый.ПредставлениеСостояния КАК ПредставлениеСостояния,
	//|	ВЫБОР
	//|		КОГДА ДокументыСОшибкамиПроверкиКонтрагентовПереопределяемый.Документ ЕСТЬ NULL
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьОшибкиПроверкиКонтрагентов,
	//|	ВЫБОР
	//|		КОГДА РеестрДокументовПереопределяемый.Проведен
	//|			ТОГДА 0
	//|		КОГДА РеестрДокументовПереопределяемый.ПометкаУдаления
	//|			ТОГДА 1
	//|		ИНАЧЕ 2
	//|	КОНЕЦ КАК НестандартнаяКартинка,
	//|	РеестрДокументовПереопределяемый.ДополнительнаяЗапись КАК ДополнительнаяЗапись,
	//|	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	//|	&СтатусПроверки КАК СтатусПроверки,
	//|	&ИндикаторПроверки КАК ИндикаторПроверки,
	//|	ТИПЗНАЧЕНИЯ(РеестрДокументовПереопределяемый.Ссылка) КАК ТипЗначения,
	//|	NULL КАК СостояниеОригиналаПервичногоДокумента,
	//|	ИСТИНА КАК ОбщееСостояние,
	//|	0 КАК СостояниеОригиналПолучен,
	//|	РеестрДокументовПереопределяемый.СторноИсправление КАК СторноИсправление,
	//|	ВЫБОР
	//|		КОГДА НЕ РеестрДокументовПереопределяемый.СторноИсправление
	//|			ТОГДА НЕОПРЕДЕЛЕНО
	//|		ИНАЧЕ РеестрДокументовПереопределяемый.СторнируемыйДокумент
	//|	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент
	//|ИЗ
	//|	РегистрСведений.РеестрДокументов КАК РеестрДокументовПереопределяемый
	//|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭДПереопределяемый
	//|		ПО (СостоянияЭДПереопределяемый.СсылкаНаОбъект = РеестрДокументовПереопределяемый.Ссылка)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСОшибкамиПроверкиКонтрагентов КАК ДокументыСОшибкамиПроверкиКонтрагентовПереопределяемый
	//|		ПО РеестрДокументовПереопределяемый.Ссылка = ДокументыСОшибкамиПроверкиКонтрагентовПереопределяемый.Документ
	//|			И (&ИспользованиеПроверкиВозможно)}
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ax_СкладскойОрдер КАК ax_СкладскойОрдер
	//|		ПО РеестрДокументовПереопределяемый.Ссылка = ax_СкладскойОрдер.ДокументОснование
	//|{ГДЕ
	//|	РеестрДокументовПереопределяемый.Ссылка.* КАК Ссылка,
	//|	ax_СкладскойОрдер.усСтатусДокумента КАК усСтатусДокумента,
	//|	РеестрДокументовПереопределяемый.МестоХранения.* КАК МестоХранения,
	//|	(ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.Склады)).* КАК Склад,
	//|	РеестрДокументовПереопределяемый.Организация.* КАК Организация,
	//|	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	//|	РеестрДокументовПереопределяемый.НомерДокументаИБ КАК Номер,
	//|	РеестрДокументовПереопределяемый.Статус КАК Статус,
	//|	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	//|	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	//|	РеестрДокументовПереопределяемый.Партнер.* КАК Партнер,
	//|	(ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Контрагент.Ключ КАК Справочник.Контрагенты)).* КАК Контрагент,
	//|	РеестрДокументовПереопределяемый.Договор.* КАК Договор,
	//|	РеестрДокументовПереопределяемый.Подразделение.* КАК Подразделение,
	//|	РеестрДокументовПереопределяемый.Ответственный.* КАК Менеджер,
	//|	РеестрДокументовПереопределяемый.Автор.* КАК Автор,
	//|	РеестрДокументовПереопределяемый.Дополнительно КАК Дополнительно,
	//|	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	//|	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	//|	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	//|	((РеестрДокументовПереопределяемый.ДатаДокументаИБ >= &НачалоПериода
	//|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	//|			И (РеестрДокументовПереопределяемый.ДатаДокументаИБ <= &КонецПериода
	//|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))) КАК Поле2}";
	//
	//ЭлементСписокДокументыПродажи = Элементы["СписокДокументыПродажи"];
	//
	//НовыйЭлемент = Элементы.Добавить("КолонкаусСтатусДокумента", Тип("ПолеФормы"), ЭлементСписокДокументыПродажи);
	//НовыйЭлемент.ПутьКДанным = "СписокДокументыПродажи.усСтатусДокумента";
	
КонецПроцедуры
