&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЭлементГруппаОсновное = Элементы.Найти("ГруппаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная", Тип("ГруппаФормы"), ЭлементГруппаОсновное);
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
		
	ЭлементУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементУС.Видимость = Истина;
	ЭлементУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементУС.Заголовок = "Отправить в УС";
	ЭлементУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементПроверенСкладом = Элементы
		.Добавить("ax_ПроверенСкладом", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементПроверенСкладом.ПутьКДанным = "Объект.ax_ПроверенСкладом";
	ЭлементПроверенСкладом.Видимость = Истина;
	ЭлементПроверенСкладом.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементПроверенСкладом.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.Заголовок = "Проверен складом";
	ЭлементПроверенСкладом.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
КонецПроцедуры
