
&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаСтраницы = Элементы.Найти("ГруппаСтраницы");
	
	СтраницаБригады = Элементы.Добавить("ТДФ1_ГруппаБригады", Тип("ГруппаФормы"), ГруппаСтраницы);
	СтраницаБригады.Вид = ВидГруппыФормы.Страница;
	СтраницаБригады.ОтображатьЗаголовок = Истина;
	СтраницаБригады.Заголовок = "Бригады";
	
	ПоляФормы = Новый Массив;
	
	ТабличноеПолеПроверил = Элементы.Добавить("ax_ТДФПроверил", Тип("ПолеФормы"), СтраницаБригады);
	ТабличноеПолеПроверил.ПутьКДанным = "Объект.ax_ТДФПроверил";
	ТабличноеПолеПроверил.Видимость = Истина;
	ТабличноеПолеПроверил.Вид = ВидПоляФормы.ПолеВвода;
	ТабличноеПолеПроверил.Заголовок = "Проверил"; 
	ТабличноеПолеПроверил.РежимВыбораИзСписка = Истина;
	ТабличноеПолеПроверил.КнопкаСоздания = Ложь;
	ТабличноеПолеПроверил.УстановитьДействие("ПриИзменении", "ПроверилПриИзменении");
	ПоляФормы.Добавить(ТабличноеПолеПроверил);
	
	ТабличноеПолеОтгрузил = Элементы.Добавить("ax_ТДФОтгрузил", Тип("ПолеФормы"), СтраницаБригады);
	ТабличноеПолеОтгрузил.ПутьКДанным = "Объект.ax_ТДФОтгрузил";
	ТабличноеПолеОтгрузил.Видимость = Истина;
	ТабличноеПолеОтгрузил.Вид = ВидПоляФормы.ПолеВвода;
	ТабличноеПолеОтгрузил.Заголовок = "Отгрузил";
	ТабличноеПолеОтгрузил.РежимВыбораИзСписка = Истина;
	ТабличноеПолеОтгрузил.КнопкаСоздания = Ложь;
	ТабличноеПолеОтгрузил.УстановитьДействие("ПриИзменении", "ОтгрузилПриИзменении");
	ПоляФормы.Добавить(ТабличноеПолеОтгрузил);
	
	ax_АдаптацияИнтерфейса.ИнициализироватьСписокВыбораПолейФормы(ПоляФормы);
	
	ЭлементГруппаОсновное = Элементы.Найти("ГруппаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная", Тип("ГруппаФормы"), ЭлементГруппаОсновное);
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ПодГруппаПараметрыОбмена = Элементы
		.Добавить("ax_ПодГруппаПараметрыОбмена",Тип("ГруппаФормы"), ГруппаПараметрыОбменаОсновная);
	ПодГруппаПараметрыОбмена.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ПодГруппаПараметрыОбмена.ОтображатьЗаголовок = Ложь;
	ПодГруппаПараметрыОбмена.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ПодГруппаПараметрыОбмена.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ПодГруппаПараметрыОбмена.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ПодГруппаПараметрыОбмена.Видимость = Истина;
	
	ЭлементГруппаЛевая = Элементы.Добавить("ax_ЭлементГруппаЛевая", Тип("ГруппаФормы"), ПодГруппаПараметрыОбмена);
	ЭлементГруппаЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаЛевая.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаЛевая.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ЭлементГруппаЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементГруппаЛевая.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементГруппаПравая = Элементы.Добавить("ax_ЭлементГруппаПравая", Тип("ГруппаФормы"), ПодГруппаПараметрыОбмена);
	ЭлементГруппаПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаПравая.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаПравая.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ЭлементГруппаПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементГруппаПравая.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ЭлементГруппаЛевая);
	ЭлементУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементУС.Видимость = Истина;
	ЭлементУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементУС.Заголовок = "Отправить в УС";
	ЭлементУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементПроверенСкладом = Элементы.Добавить("ax_ПроверенСкладом", Тип("ПолеФормы"), ЭлементГруппаЛевая);
	ЭлементПроверенСкладом.ПутьКДанным = "Объект.ax_ПроверенСкладом";
	ЭлементПроверенСкладом.Видимость = Истина;	
	ЭлементПроверенСкладом.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементПроверенСкладом.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.Заголовок = "Проверен складом";
	ЭлементПроверенСкладом.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементОтменитьЗаказ = Элементы.Добавить("ax_ОтменитьЗаказ", Тип("ПолеФормы"), ЭлементГруппаЛевая);
	ЭлементОтменитьЗаказ.ПутьКДанным = "Объект.ax_ОтменитьЗаказ";
	ЭлементОтменитьЗаказ.Видимость = Истина;
	ЭлементОтменитьЗаказ.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементОтменитьЗаказ.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементОтменитьЗаказ.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементОтменитьЗаказ.Заголовок = "Отменить заказ";
	ЭлементОтменитьЗаказ.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементТребуетсяДоставка = Элементы
		.Добавить("ax_ЗавозТребуетсяДоставка", Тип("ПолеФормы"), ЭлементГруппаПравая);
	ЭлементТребуетсяДоставка.ПутьКДанным = "Объект.ax_ЗавозТребуетсяДоставка";
	ЭлементТребуетсяДоставка.Видимость = Истина;
	ЭлементТребуетсяДоставка.Доступность = Ложь;
	ЭлементТребуетсяДоставка.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТребуетсяДоставка.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.Заголовок = "Требуется доставка";
	ЭлементТребуетсяДоставка.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементДатаЗавоза = Элементы.Добавить("ax_ДатаЗавоза", Тип("ПолеФормы"), ЭлементГруппаПравая);
	ЭлементДатаЗавоза.ПутьКДанным = "Объект.ax_ТДФДатаЗавоза";
	ЭлементДатаЗавоза.Видимость = Истина;
	ЭлементДатаЗавоза.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаЗавоза.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементДатаЗавоза.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементДатаЗавоза.Заголовок = "Дата завоза";
	ЭлементДатаЗавоза.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ЭлементДатаЗавоза.РастягиватьПоГоризонтали = Ложь; 
	ЭлементДатаЗавоза.УстановитьДействие("ПриИзменении", "ДатаЗавозаПриИзменении");
	
	ЭлементКомментарийСклад = Элементы
		.Добавить("ax_КомментарийСклад", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементКомментарийСклад.ПутьКДанным = "Объект.ax_КомментарийСклад";
	ЭлементКомментарийСклад.Видимость = Истина;
	ЭлементКомментарийСклад.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКомментарийСклад.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.Заголовок = "Комментарий для склада";
	ЭлементКомментарийСклад.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх; 
	ЭлементКомментарийСклад.РастягиватьПоГоризонтали = Истина;
	ЭлементКомментарийСклад.МногострочныйРежим = Истина;
	ЭлементКомментарийСклад.Ширина = 76;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗавозаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ax_ТДФДатаЗавоза) Тогда 
		Объект.ax_ЗавозТребуетсяДоставка = Истина;
	Иначе 
		Объект.ax_ЗавозТребуетсяДоставка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверилПриИзменении(Элемент)	
	Если ЗначениеЗаполнено(Объект.ax_ТДФПроверил) Тогда
		Объект.ax_ТДФПроверилДата = ПолучитьТекущуюДатуСеанса();		
	Иначе 
		Объект.ax_ТДФПроверилДата = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузилПриИзменении(Элемент)	
	Если ЗначениеЗаполнено(Объект.ax_ТДФОтгрузил) Тогда		
		Объект.ax_ТДФОтгрузилДата = ПолучитьТекущуюДатуСеанса();	
	Иначе 
		Объект.ax_ТДФОтгрузилДата = Дата(1,1,1);		
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();	
КонецФункции

