#Область ПрограммныйИнтерфейс

Процедура ИзменитьРеквизитыФормы(Форма, СтруктурыРеквизитовМассив) Экспорт 
	
	// ПримерИспользования
	//СтруктураРеквизитовМассив = Новый Массив;
	//СтруктураРеквизитовМассив.Добавить(
	//	Новый Структура (
	//		"Имя, Тип", 
	//		"СписокБригадиры", 
	//		ax_ДинамическоеФормированиеИнтерфейса.ОписаниеТипаТаблицаЗначений()));
	//СтруктураРеквизитовМассив.Добавить(
	//	Новый Структура (
	//		"Имя, Тип, Путь, Заголовок", 
	//		"Бригадир", 
	//		ax_ДинамическоеФормированиеИнтерфейса.ОписаниеТипаСправочник("Пользователи"),
	//		"СписокБригадиры", 
	//		"Бригадир"));
	//ax_АдаптацияИнтерфейса.ИзменитьРеквизитыФормы(ЭтотОбъект, СтруктурыРеквизитовМассив);
		
	Форма.ИзменитьРеквизиты(СформироватьДобавляемыеРеквизиты(СтруктурыРеквизитовМассив));
	
КонецПроцедуры		

Процедура ИнициализироватьСписокВыбораПолейФормы(ПоляФормы) Экспорт 
	
	РезультатыЗапросаБригадиры = ПолучитьРезультатыЗапросаБригадиры(Новый Запрос, ТекстЗапросаБригадиры());	
	Если РезультатыЗапросаБригадиры.Бригадиры.Пустой() Тогда 
		Возврат;	
	КонецЕсли;	
	БригадирыТаблица = РезультатыЗапросаБригадиры.Бригадиры.Выгрузить();		
	Для Каждого Поле Из ПоляФормы Цикл 
		Поле.СписокВыбора.ЗагрузитьЗначения(БригадирыТаблица.ВыгрузитьКолонку("Бригадир"));
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРезультатыЗапросаБригадиры(Запрос, ТекстЗапроса)
	
	ТекстыЗапроса = Новый СписокЗначений();
	ТекстыЗапроса.Добавить(ТекстЗапроса, "Бригадиры");	
	Возврат ОбщегоНазначенияУТ.ПолучитьРезультатыЗапроса(Запрос, ТекстыЗапроса);
	
КонецФункции

Функция ТекстЗапросаБригадиры()
	
	Возврат "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК ПользовательСсылка,
	|	Пользователи.Представление КАК Представление
	|ПОМЕСТИТЬ вт_ОтборДействительныхПользователей
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК ДополнительныеРеквизитыСсылка,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование
	|ПОМЕСТИТЬ вт_ОтборПВХДополнительныеРеквизиты
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Наименование ПОДОБНО ""Бригадир""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка КАК ПользователиСсылка,
	|	ДополнительныеРеквизиты.Свойство КАК Свойство
	|ПОМЕСТИТЬ вт_ОтборПользователиБригадиры
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ОтборПВХДополнительныеРеквизиты КАК вт_ОтборПВХ
	|		ПО ДополнительныеРеквизиты.Свойство = вт_ОтборПВХ.ДополнительныеРеквизитыСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОтборДействительныхПользователей.ПользовательСсылка КАК Бригадир,
	|	вт_ОтборДействительныхПользователей.Представление КАК БригадирПредставление
	|ИЗ
	|	вт_ОтборДействительныхПользователей КАК вт_ОтборДействительныхПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ОтборПользователиБригадиры КАК вт_ОтборПользователиБригадиры
	|		ПО вт_ОтборДействительныхПользователей.ПользовательСсылка = вт_ОтборПользователиБригадиры.ПользователиСсылка";	
	
КонецФункции

Функция СформироватьДобавляемыеРеквизиты(СтруктураРеквизитовМассив)
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Элемент Из СтруктураРеквизитовМассив Цикл 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы(Элемент));
	КонецЦикла;
	Возврат ДобавляемыеРеквизиты;
	
КонецФункции

Функция НовыйРеквизитФормы(СтруктураРеквизита)
	
	Имя = ?(СтруктураРеквизита.Свойство("Имя"), СтруктураРеквизита.Имя, Неопределено);
	Тип = ?(СтруктураРеквизита.Свойство("Тип"), СтруктураРеквизита.Тип, Неопределено);
	Путь = ?(СтруктураРеквизита.Свойство("Путь"), СтруктураРеквизита.Путь, Неопределено);
	Заголовок = ?(СтруктураРеквизита.Свойство("Заголовок"), СтруктураРеквизита.Заголовок, Неопределено);
	Возврат Новый РеквизитФормы(Имя, Тип, Путь, Заголовок);	
	
КонецФункции

#КонецОбласти