&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа0 = Элементы.Найти("ГруппаОсновное");

	Группа1 = Элементы.Добавить("ТДФ1_ГруппаФормы",Тип("ГруппаФормы"),Группа0);
    Группа1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    Группа1.ОтображатьЗаголовок = Истина;
	Группа1.Заголовок = "ТД Форт";
    Группа1.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа1.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);

	Группа2 = Элементы.Добавить("ТДФ1_ГруппаФормы2",Тип("ГруппаФормы"),Группа1);
    Группа2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    Группа2.ОтображатьЗаголовок = Ложь;
    Группа2.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	Группа2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа2.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);

	ТабличноеПоле1 = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), Группа2);
    ТабличноеПоле1.ПутьКДанным = "Объект.ax_УС";
    ТабличноеПоле1.Видимость = Истина;
	ТабличноеПоле1.Вид = ВидПоляФормы.ПолеФлажка;
	ТабличноеПоле1.ЦветТекста = Новый Цвет(25, 100, 100);
	ТабличноеПоле1.ЦветРамки = Новый Цвет(25, 100, 100);
    ТабличноеПоле1.Заголовок = "Отправить в УС";
	ТабличноеПоле1.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ТабличноеПоле2 = Элементы.Добавить("ax_ПроверенСкладом", Тип("ПолеФормы"), Группа1);
    ТабличноеПоле2.ПутьКДанным = "Объект.ax_ПроверенСкладом";
    ТабличноеПоле2.Видимость = Истина;
	ТабличноеПоле2.Вид = ВидПоляФормы.ПолеФлажка;
	ТабличноеПоле2.ЦветТекста = Новый Цвет(25, 100, 100);
	ТабличноеПоле2.ЦветРамки = Новый Цвет(25, 100, 100);
    ТабличноеПоле2.Заголовок = "Проверен складом";
	ТабличноеПоле2.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);

КонецПроцедуры
