
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Попытка
		мОпределения = Новый WSОпределения(Объект.URL+"?wsdl", Объект.Пользователь, Объект.Пароль);
		Прокси = Новый WSПрокси(мОпределения,"http://www.axelot.ru/tms2_exchange/package", "axExchange", "axExchangeSoap");
		Прокси.Пользователь = Объект.Пользователь;
		Прокси.Пароль       = Объект.Пароль;

		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Соединение настроено корректно.'"));		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Соединение настроено не корректно. Ошибка: %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		СобытиеЖурналаРегистрации = ОбменДаннымиWMS4.ВернутьСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации[2], УровеньЖурналаРегистрации.Ошибка, , ,"при ПроверитьСоединениеНаСервере: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры
