
&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ТаблицаФормыТовары = Элементы.Найти("Товары");
	
	ПолеФормыПримерка = Элементы.Вставить(
		"ax_КоличествоФакт",
		Тип("ПолеФормы"),
		ТаблицаФормыТовары,
		ТаблицаФормыТовары.ПодчиненныеЭлементы["ТоварыКоличествоУпаковок"]
	);
		
	ПолеФормыПримерка.ПутьКДанным = "Объект.Товары.ax_Примерка";
	ПолеФормыПримерка.Видимость = Истина;
	ПолеФормыПримерка.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеФормыПримерка.Заголовок = "Примерка";
	
КонецПроцедуры
