#Область СлужебныйПрограммныйИнтерфейс

#Область ОбменСWMS 

// Установка статусов приходных ордеров
// Создает или находит приходный ордер  
// если он не отменен в WMS то устанавливает статус приходного ордера
// 		дополнительно если массив ТоварыПоступлениявWMS не пустой 
//			то перезаписывается табличная часть приходного ордера Товары
// если он отменен в WMS то найденный приходный ордер распроводится и помечается на удаление
//
// ПриходныйОрдерНаТовары.Отправитель ОпределяемыйТип.ОтправительПолучательТоваров
// 		ОпределяемыйТип.ОтправительПолучательТоваров
//			СправочникСсылка.СтруктураПредприятия, 
//			СправочникСсылка.Партнеры, 
//			СправочникСсылка.ФизическиеЛица, 
//			СправочникСсылка.Склады
Функция SetDocumentStatus(Object, NodeID, Status)
	
	СозданиеОрдераСтруктура = ax_СинхронизацияПриемкиОтгрузкиТоваров
		.НовыйСозданиеОрдераСтруктура();
				
	ax_СинхронизацияПриемкиОтгрузкиТоваров
		.ОбъектXDTOВСозданиеОрдераПоступлениеСтруктура(Object, СозданиеОрдераСтруктура);	
		
	Если СозданиеОрдераСтруктура.Ошибка Тогда
		
		ОбменДаннымиWMS4.ЗаписатьВЖурналРегистрации(
			СтрШаблон( "SetDocumentStatus():
				|%1", СозданиеОрдераСтруктура.ТекстСообщения));
		
	ИначеЕсли НЕ СозданиеОрдераСтруктура.ДокументОснованияПроведен Тогда 
		СозданиеОрдераСтруктура.Результат = Истина;
	Иначе 	
		ax_СинхронизацияПриемкиОтгрузкиТоваров
			.УстановитьФактПриемки(СозданиеОрдераСтруктура, Status);
	КонецЕсли;
	
	// не критические ошибки
	Если НЕ СозданиеОрдераСтруктура.Ошибка 
		И НЕ ПустаяСтрока(СозданиеОрдераСтруктура.ТекстСообщения)  Тогда 
		
		ТекстСообщения = СтрШаблон("SetDocumentStatus():
			|%1", СозданиеОрдераСтруктура.ТекстСообщения);
				
		ОбменДаннымиWMS4.ЗаписатьВЖурналРегистрации(
			ТекстСообщения, 
			"Предупреждение",
			СозданиеОрдераСтруктура.ДокументОснования.Метаданные(), 
			СозданиеОрдераСтруктура.ДокументОснования);
			
	КонецЕсли;	
	
	Возврат СозданиеОрдераСтруктура.Результат;
	
КонецФункции

// Загрузка ПриходныйОрдерНаТовары
//
Функция SetArrivalFact(Object, NodeID)
	
	СозданиеОрдераСтруктура = ax_СинхронизацияПриемкиОтгрузкиТоваров
		.НовыйСозданиеОрдераСтруктура();

	ax_СинхронизацияПриемкиОтгрузкиТоваров
		.ОбъектXDTOВСозданиеОрдераПоступлениеСтруктура(Object, СозданиеОрдераСтруктура);
	
	Если СозданиеОрдераСтруктура.Ошибка Тогда
		
		ОбменДаннымиWMS4.ЗаписатьВЖурналРегистрации(
			СтрШаблон( "SetArrivalFact():
				|%1", СозданиеОрдераСтруктура.ТекстСообщения));
		
	ИначеЕсли НЕ СозданиеОрдераСтруктура.ДокументОснованияПроведен Тогда 
		СозданиеОрдераСтруктура.Результат = Истина;
	Иначе 	
		ax_СинхронизацияПриемкиОтгрузкиТоваров
			.УстановитьФактПриемки(СозданиеОрдераСтруктура);
	КонецЕсли;
	
	// не критические ошибки
	Если НЕ СозданиеОрдераСтруктура.Ошибка 
		И НЕ ПустаяСтрока(СозданиеОрдераСтруктура.ТекстСообщения) Тогда 
		
		ТекстСообщения = СтрШаблон("SetArrivalFact():
			|%1", СозданиеОрдераСтруктура.ТекстСообщения);
				
		ОбменДаннымиWMS4.ЗаписатьВЖурналРегистрации(
			ТекстСообщения,
			"Предупреждение",
			СозданиеОрдераСтруктура.ДокументОснования.Метаданные(), 
			СозданиеОрдераСтруктура.ДокументОснования);
			
	КонецЕсли;	
	
	Возврат СозданиеОрдераСтруктура.Результат;
  
КонецФункции

// Загрузка РасходныйОрдерНаТовары
//
Функция SetShipmentFact(Object, NodeID)
	
	СозданиеОрдераСтруктура = ax_СинхронизацияПриемкиОтгрузкиТоваров
		.НовыйСозданиеОрдераСтруктура();
		
	ax_СинхронизацияПриемкиОтгрузкиТоваров
		.ОбъектXDTOВСозданиеОрдераОтгрузкаСтруктура(
			Object, СозданиеОрдераСтруктура);	
		
	Если СозданиеОрдераСтруктура.Ошибка Тогда
		
		ОбменДаннымиWMS4.ЗаписатьВЖурналРегистрации(
			СтрШаблон( "SetFactShipment():
			|%1", СозданиеОрдераСтруктура.ТекстСообщения));
		
	ИначеЕсли НЕ СозданиеОрдераСтруктура.ДокументОснованияПроведен Тогда 
		СозданиеОрдераСтруктура.Результат = Истина;
	Иначе 	
		ax_СинхронизацияПриемкиОтгрузкиТоваров
			.УстановитьФактОтгрузки(СозданиеОрдераСтруктура);
	КонецЕсли;
	
	// не критические ошибки
	Если НЕ СозданиеОрдераСтруктура.Ошибка 
		И НЕ ПустаяСтрока(СозданиеОрдераСтруктура.ТекстСообщения) Тогда 
		
		ТекстСообщения = СтрШаблон("SetFactShipment():
			|%1", СозданиеОрдераСтруктура.ТекстСообщения);
		
		ОбменДаннымиWMS4.ЗаписатьВЖурналРегистрации(
			ТекстСообщения, 
			"Предупреждение",
			СозданиеОрдераСтруктура.ДокументОснования.Метаданные(), 
			СозданиеОрдераСтруктура.ДокументОснования);

	КонецЕсли;
		
	Возврат СозданиеОрдераСтруктура.Результат;
	
КонецФункции

Функция GetRemains(NodeID)
	ТаблицаНастройкиУзлов = ПланыОбмена.ОбменУправлениеТорговлейWMS4.ПолучитьНастройкиУзлов();	
	ЗначениеИзСтрокиXML = ОбщегоНазначения.ЗначениеИзСтрокиXML(NodeID);	
	СтруктураОтвет = Новый Структура("ТаблицаОстаткиУТ, Результат, ТекстСообщения", Неопределено, Ложь, "");
	ТекстСообщения = "";
	
	СтрокиТаблицыНастройкиУзлов = ТаблицаНастройкиУзлов
		.НайтиСтроки (Новый Структура("Идентификатор", ЗначениеИзСтрокиXML.ИдентификаторУзла));
		
	Если СтрокиТаблицыНастройкиУзлов.Количество() = 0 Тогда 
		ТекстСообщения = СтрШаблон("%1
			|Не удалось найти  узел обмена в базе по идентификатору узла: %2", 
			ТекстСообщения, ЗначениеИзСтрокиXML.ИдентификаторУзла);	
	КонецЕсли;
	
	Если ЗначениеИзСтрокиXML.МассивУИДы.Количество() = 0 Тогда 
		ТекстСообщения = СтрШаблон("%1
			|Пустой список  УИДов номенклатуры по идентификатору узла: %2", 
			ТекстСообщения, ЗначениеИзСтрокиXML.ИдентификаторУзла);		
	КонецЕсли;
	
	Склады = Новый Массив;
	Для Каждого СтрокаТаблицыНастройкиУзлов Из СтрокиТаблицыНастройкиУзлов Цикл 
		Склады.Добавить(СтрокаТаблицыНастройкиУзлов.Склад);
	КонецЦикла;
		
	СписокНоменклатуры = Новый Массив;
	Для Каждого УИД Из ЗначениеИзСтрокиXML.МассивУИДы Цикл
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		
		Если Найти(Строка(НоменклатураСсылка), "<Объект не найден>") <> 0 Тогда
			ТекстСообщения = СтрШаблон("%1
				|Не удалось найти номенклатуру в базе по УИД: %2", ТекстСообщения, УИД);
		Иначе 
			СписокНоменклатуры.Добавить(НоменклатураСсылка);	
		КонецЕсли;
	КонецЦикла;
	
	Если Склады.Количество() > 0 И СписокНоменклатуры.Количество() > 0 Тогда 
		СтруктураРезультатЗапроса = ОбменДаннымиWMS4
			.ОстаткиНоменклатурыНаСкладах(СписокНоменклатуры, Склады);
			
		Если НЕ СтруктураРезультатЗапроса.Ошибка	Тогда 
			СтруктураОтвет.ТаблицаОстаткиУТ = СтруктураРезультатЗапроса.РезультатЗапроса.Выгрузить();
			СтруктураОтвет.Результат = Истина;	
		Иначе 
			СтруктураОтвет.ТекстСообщения = СтруктураРезультатЗапроса.ОписаниеОшибки;	
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвет.ТекстСообщения = СокрЛП(ТекстСообщения);
	
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураОтвет);
	
	Возврат СтрокаXML;
КонецФункции

#Область ОбменСWMS_старый 

// Загрузка Отражения факта приемки
//
// 2022.03.24 1c_dev2
// В эту процедуру попадаю только Приемки
Функция _SetArrivalFact(Object, NodeID)
	
	Попытка
		
		Если Object.DocumentType = "Оприходование товаров" Тогда
			ИмяДокумента = "ОприходованиеТоваров";
			ИмяРеквизитаСклад = "Склад";
		ИначеЕсли Object.DocumentType = "Возврат от клиента" Тогда
			ИмяДокумента = "ВозвратТоваровОтПокупателя";
			ИмяРеквизитаСклад = "СкладОрдер";
		ИначеЕсли Object.DocumentType = "Приемка от поставщика" Тогда
			ИмяДокумента = "ЗаказПоставщику";
			ИмяРеквизитаСклад = "Склад";
		ИначеЕсли Object.DocumentType = "Приемка со склада" Тогда
			ИмяДокумента = "ПеремещениеТоваров";
			ИмяРеквизитаСклад = "СкладОтправитель";
		ИначеЕсли Object.DocumentType = "Корректировка реализации" Тогда
			ИмяДокумента = "КорректировкаРеализации";
			ИмяРеквизитаСклад = "Склад";
		ИначеЕсли Object.DocumentType = "Приемка из производства" Тогда
			ИмяДокумента = "КомплектацияНоменклатуры";
			ИмяРеквизитаСклад = "Склад";
		Иначе
			Возврат Истина;
		КонецЕсли;	
		
		НачатьТранзакцию();
		
		ДокументОснование 		= Документы[ИмяДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Object.ID));
		СтатусДокументаИзWMS 	= СопоставитьСтатусWMS4_ОжидаемаяПриемка(Object.Status);
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ax_СкладскойОрдер.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ax_СкладскойОрдер КАК ax_СкладскойОрдер
		|ГДЕ
		|	ax_СкладскойОрдер.ДокументОснование = &ДокументОснование
		|	И ax_СкладскойОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ТДФ_ВидОперацииСкладскойОрдерWMS.ПриходныйОрдер)
		|	И ax_СкладскойОрдер.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументОбъект = Выборка.ДокументСсылка.ПолучитьОбъект();
			// 2022.04.04 1c_dev2 [start] 
			// Статус для найденного складского ордера устанавливается из Ожидаемой приемки 
			//ДокументОбъект.усСтатусДокумента 	= СтатусДокументаИзWMS;
			// 2022.04.04 1c_dev2 [end]
			ДокументОбъект.ax_КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
			ДокументОбъект.Товары.Очистить();
		Иначе
			ДокументОбъект 						= Документы.ax_СкладскойОрдер.СоздатьДокумент();
			ДокументОбъект.ВидОперации 			= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.ПриходныйОрдер;
			ДокументОбъект.Склад 				= ДокументОснование[ИмяРеквизитаСклад];
			ДокументОбъект.ДокументОснование 	= ДокументОснование;
			ДокументОбъект.усСтатусДокумента 	= СтатусДокументаИзWMS;
			ДокументОбъект.КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
			ДокументОбъект.Дата 				= Object.Date;
			ДокументОбъект.Номер 				= Object.Number;
		КонецЕсли;	
			
		Для Каждого СтрокаОбъектаXDTO Из Object.GoodsLine Цикл
			
			КодСтроки 			= Число(СтрокаОбъектаXDTO.LineNum);
			КоличествоФакт 		= СтрокаОбъектаXDTO.QuantityFact;
			
			СтруктураПоискаСтроки = Новый Структура("КодСтроки",КодСтроки);
			
			мсвНайденныхСтрок = ДокументОбъект.Товары.НайтиСтроки(СтруктураПоискаСтроки);
			Если мсвНайденныхСтрок.Количество()>0 Тогда
				
				мсвНайденныхСтрок[0].КоличествоФакт = КоличествоФакт;
				
			Иначе

				Если Object.DocumentType = "Приемка из производства" Тогда // приемка из комплектации, по документу принимается только один товар
					
					// Новая строка
					СтрокаДокумента 					= ДокументОбъект.Товары.Добавить();
					СтрокаДокумента.Номенклатура 		= ДокументОснование.Номенклатура;
					СтрокаДокумента.ЕдиницаИзмерения 	= ДокументОснование.ЕдиницаИзмерения;
					СтрокаДокумента.КодСтроки		 	= "";
					СтрокаДокумента.КоличествоФакт	 	= КоличествоФакт;
					
				Иначе
	            	
					СтрокаТЧ_ДокументОснование = ДокументОснование.Товары.Найти(КодСтроки, "КодСтроки");	
					
					Если СтрокаТЧ_ДокументОснование = Неопределено Тогда
						// Лишнее не отражаем
						Продолжить;
					КонецЕсли;	
					
					// Новая строка
					СтрокаДокумента 					= ДокументОбъект.Товары.Добавить();
					СтрокаДокумента.Номенклатура 		= СтрокаТЧ_ДокументОснование.Номенклатура;
					СтрокаДокумента.ЕдиницаИзмерения 	= СтрокаТЧ_ДокументОснование.ЕдиницаИзмерения;
					СтрокаДокумента.КодСтроки		 	= СтрокаТЧ_ДокументОснование.КодСтроки;
					СтрокаДокумента.КоличествоФакт	 	= КоличествоФакт;
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		усСхождение = Истина;
		
		табПроверкаСхождения = Новый ТаблицаЗначений();
		табПроверкаСхождения.Колонки.Добавить("КодСтроки");
		табПроверкаСхождения.Колонки.Добавить("Количество");
		табПроверкаСхождения.Колонки.Добавить("КоличествоФакт");
		
		Для Каждого СтрокаСкладскойОрдер Из ДокументОбъект.Товары Цикл
			
			СтрокаТабПроверки 					= табПроверкаСхождения.Добавить();
			СтрокаТабПроверки.КодСтроки 		= СтрокаСкладскойОрдер.КодСтроки;
			СтрокаТабПроверки.КоличествоФакт 	= СтрокаСкладскойОрдер.КоличествоФакт;
			СтрокаТабПроверки.Количество 		= 0;
			
		КонецЦикла;	
		
		Если Object.DocumentType = "Приемка из производства" Тогда
			
			СтрокаТабПроверки 					= табПроверкаСхождения.Добавить();
			СтрокаТабПроверки.КодСтроки 		= "";
			СтрокаТабПроверки.Количество 		= ДокументОснование.Количество;
			СтрокаТабПроверки.КоличествоФакт 	= 0;
			
		Иначе
			Для Каждого СтрокаДокументОснование Из ДокументОснование.Товары Цикл
				
				СтрокаТабПроверки 					= табПроверкаСхождения.Добавить();
				СтрокаТабПроверки.КодСтроки 		= СтрокаДокументОснование.КодСтроки;
				СтрокаТабПроверки.Количество 		= СтрокаДокументОснование.Количество;
				СтрокаТабПроверки.КоличествоФакт 	= 0;
				
			КонецЦикла;	
		КонецЕсли;
		
		табПроверкаСхождения.Свернуть("КодСтроки", "Количество, КоличествоФакт");
		
		Для Каждого СтрокаПроверки Из табПроверкаСхождения Цикл
			
			Если СтрокаПроверки.Количество <> СтрокаПроверки.КоличествоФакт Тогда
				усСхождение = Ложь;
			КонецЕсли;	
			
		КонецЦикла;	
		
		ДокументОбъект.усСходитсяПланФакт = усСхождение;
				
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"SetArrivalFact(): " + ОписаниеОшибки);
		Возврат Ложь;
		
	КонецПопытки;
КонецФункции // SetArrivalFact()

// Загрузка факта отгрузки
//
Функция _SetFactShipment(Object, NodeID)
	
	Попытка
		
		Если Object.DocumentType = "Отгрузка клиенту" Тогда
			ИмяДокумента 		= "РеализацияТоваровУслуг";
			ИмяРеквизитаСклад 	= "Склад";
		ИначеЕсли Object.DocumentType = "Самовывоз" Тогда
			ИмяДокумента 		= "РеализацияТоваровУслуг";
			ИмяРеквизитаСклад 	= "Склад";
		ИначеЕсли Object.DocumentType = "Отгрузка на склад" Тогда
			ИмяДокумента 		= "ПеремещениеТоваров";
			ИмяРеквизитаСклад 	= "СкладОтправитель";
		ИначеЕсли Object.DocumentType = "Списание" Тогда
			ИмяДокумента 		= "СписаниеТоваров";
			ИмяРеквизитаСклад 	= "Склад";
		ИначеЕсли Object.DocumentType = "Корректировка реализации" Тогда
			ИмяДокумента = "КорректировкаРеализации";
			ИмяРеквизитаСклад = "Склад";
		ИначеЕсли Object.DocumentType = "Отгрузка в производство" Тогда
			ИмяДокумента = "КомплектацияНоменклатуры";
			ИмяРеквизитаСклад = "Склад";
		Иначе
			Возврат Истина;
		КонецЕсли;		
		
		НачатьТранзакцию();
		
		ДокументОснование 		= Документы[ИмяДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Object.ID));
		СтатусДокументаИзWMS 	= СопоставитьСтатусWMS4_ОжидаемаяПриемка(Object.Status);
		
		//ЗаписьЖурналаРегистрации("WMS_Status", УровеньЖурналаРегистрации.Ошибка, , ДокументОснование, Строка(ДокументОснование) + " = " + Строка(Object.Status));
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ax_СкладскойОрдер.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ax_СкладскойОрдер КАК ax_СкладскойОрдер
		|ГДЕ
		|	ax_СкладскойОрдер.ДокументОснование = &ДокументОснование
		|	И ax_СкладскойОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ТДФ_ВидОперацииСкладскойОрдерWMS.РасходныйОрдер)
		|	И НЕ ax_СкладскойОрдер.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументОбъект = Выборка.ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.усСтатусДокумента 	= СтатусДокументаИзWMS;
			//ДокументОбъект.ax_КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
			ДокументОбъект.КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description);
			ДокументОбъект.Товары.Очистить();
		Иначе
			ДокументОбъект 						= Документы.ax_СкладскойОрдер.СоздатьДокумент();
			ДокументОбъект.ВидОперации 			= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.РасходныйОрдер;
			ДокументОбъект.Склад 				= ДокументОснование[ИмяРеквизитаСклад];
			ДокументОбъект.ДокументОснование 	= ДокументОснование;
			ДокументОбъект.усСтатусДокумента 	= СтатусДокументаИзWMS;
			//ДокументОбъект.ax_КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
			ДокументОбъект.КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
			ДокументОбъект.Дата 				= Object.Date;
			ДокументОбъект.Номер 				= Object.Number;
		КонецЕсли;	
			
		Для Каждого СтрокаОбъектаXDTO Из Object.GoodsLine Цикл
			
			КодСтроки 			= Число(СтрокаОбъектаXDTO.LineNum);
			КоличествоФакт 		= СтрокаОбъектаXDTO.QuantityFact;
			
			//ЗаписьЖурналаРегистрации("WMS_Количество", УровеньЖурналаРегистрации.Ошибка, , ДокументОснование, "Код строки: " + Строка(КодСтроки) + ", количество: " + Строка(КоличествоФакт));
			
			// СтруктураПоискаСтроки = Новый Структура("КодСтроки",КодСтроки);
			// код строки у документов имеет тип число
			СтруктураПоискаСтроки = Новый Структура("КодСтроки",КодСтроки);
			
			мсвНайденныхСтрок = ДокументОбъект.Товары.НайтиСтроки(СтруктураПоискаСтроки);
			Если мсвНайденныхСтрок.Количество()>0 Тогда
				
				мсвНайденныхСтрок[0].КоличествоФакт = КоличествоФакт;
				
			Иначе      
				
				Если Object.DocumentType = "Отгрузка в производство" Тогда // отгрузка в производство, по документу отгружаются комплектующие
					СтрокаТЧ_ДокументОснование = ДокументОснование.Комплектующие.Найти(КодСтроки, "КодСтроки");	
				Иначе
					СтрокаТЧ_ДокументОснование = ДокументОснование.Товары.Найти(КодСтроки, "КодСтроки");	
				КонецЕсли;
					
				Если СтрокаТЧ_ДокументОснование = Неопределено Тогда
					// Лишнее не отражаем
					Продолжить;
				КонецЕсли;	
				
				ЕдиницаИзмерения = ?(
					СтрокаТЧ_ДокументОснование.Упаковка <> Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(),
				    СтрокаТЧ_ДокументОснование.Упаковка,
					СтрокаТЧ_ДокументОснование.Номенклатура.ЕдиницаИзмерения
				);
				
				// Новая строка
				СтрокаДокумента 					= ДокументОбъект.Товары.Добавить();
				СтрокаДокумента.Номенклатура 		= СтрокаТЧ_ДокументОснование.Номенклатура;
				СтрокаДокумента.ЕдиницаИзмерения 	= ЕдиницаИзмерения;
				СтрокаДокумента.КодСтроки		 	= СтрокаТЧ_ДокументОснование.КодСтроки;
				СтрокаДокумента.КоличествоФакт	 	= КоличествоФакт;
				
			КонецЕсли;

		КонецЦикла;	
		
		усСхождение = Истина;
		
		табПроверкаСхождения = Новый ТаблицаЗначений();
		табПроверкаСхождения.Колонки.Добавить("КодСтроки");
		табПроверкаСхождения.Колонки.Добавить("Количество");
		табПроверкаСхождения.Колонки.Добавить("КоличествоФакт");
		
		Для Каждого СтрокаСкладскойОрдер Из ДокументОбъект.Товары Цикл
			
			СтрокаТабПроверки 					= табПроверкаСхождения.Добавить();
			СтрокаТабПроверки.КодСтроки 		= СтрокаСкладскойОрдер.КодСтроки;
			СтрокаТабПроверки.КоличествоФакт 	= СтрокаСкладскойОрдер.КоличествоФакт;
			СтрокаТабПроверки.Количество 		= 0;
			
		КонецЦикла;	

		Если Object.DocumentType = "Отгрузка в производство" Тогда
			Для Каждого СтрокаДокументОснование Из ДокументОснование.Комплектующие Цикл
				
				СтрокаТабПроверки 					= табПроверкаСхождения.Добавить();
				СтрокаТабПроверки.КодСтроки 		= СтрокаДокументОснование.КодСтроки;
				СтрокаТабПроверки.Количество 		= СтрокаДокументОснование.Количество;
				СтрокаТабПроверки.КоличествоФакт 	= 0;
				
			КонецЦикла;	
		Иначе
			Для Каждого СтрокаДокументОснование Из ДокументОснование.Товары Цикл
				
				СтрокаТабПроверки 					= табПроверкаСхождения.Добавить();
				СтрокаТабПроверки.КодСтроки 		= СтрокаДокументОснование.КодСтроки;
				СтрокаТабПроверки.Количество 		= СтрокаДокументОснование.Количество;
				СтрокаТабПроверки.КоличествоФакт 	= 0;
				
			КонецЦикла;	
		КонецЕсли;
		
		табПроверкаСхождения.Свернуть("КодСтроки", "Количество, КоличествоФакт");
		
		Для Каждого СтрокаПроверки Из табПроверкаСхождения Цикл
			
			Если СтрокаПроверки.Количество <> СтрокаПроверки.КоличествоФакт Тогда
				усСхождение = Ложь;
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
		ДокументОбъект.усСходитсяПланФакт = усСхождение;
				
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"SetFactShipment(): " + ОписаниеОшибки);
		Возврат Ложь;
		
	КонецПопытки;
КонецФункции

// Загрузка акта сверки инвентаризации
//
Функция SetInventory(Object, NodeID)
	
	Попытка
		НачатьТранзакцию();
		
		// Вручную, без автоматических формирований
		
		ЗафиксироватьТранзакцию();
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"SetInventory(): " + ОписаниеОшибки);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// Загрузка статуса заказа документа
//
// 2022.03.24 1c_dev2
// В эту процедуру попадаю только Ожидаемые приемки
Функция _SetDocumentStatus(Object, NodeID, Status) Экспорт
		
	Попытка
		
		Если Object.DocumentType = "Приемка от поставщика" Тогда
			
			ИмяДокумента 		= "ЗаказПоставщику";
			ИмяРеквизитаСклад 	= "Склад";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.ПриходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Приемка со склада" Тогда
			
			ИмяДокумента 		= "ПеремещениеТоваров";
			ИмяРеквизитаСклад 	= "СкладПолучатель";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.ПриходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Возврат от клиента" Тогда
			
			ИмяДокумента 		= "ВозвратТоваровОтПокупателя";
			ИмяРеквизитаСклад 	= "СкладОрдер";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.ПриходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Оприходование товаров" Тогда
			
			ИмяДокумента 		= "ОприходованиеТоваров";
			ИмяРеквизитаСклад 	= "Склад";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.ПриходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Отгрузка клиенту" Тогда
			
			ИмяДокумента 		= "РеализацияТоваровУслуг";
			ИмяРеквизитаСклад 	= "Склад";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.РасходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Самовывоз" Тогда
			
			ИмяДокумента 		= "РеализацияТоваровУслуг";
			ИмяРеквизитаСклад 	= "Склад";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.РасходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Отгрузка на склад" Тогда
			
			ИмяДокумента 		= "ПеремещениеТоваров";
			ИмяРеквизитаСклад 	= "СкладОтправитель";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.РасходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "Списание" Тогда
			
			ИмяДокумента 		= "СписаниеТоваров";
			ИмяРеквизитаСклад 	= "Склад";
			ВидОперации 		= Перечисления.ТДФ_ВидОперацииСкладскойОрдерWMS.РасходныйОрдер;
			
		ИначеЕсли Object.DocumentType = "КорректировкаРеализации" Тогда
			
			Возврат Истина;
			
		Иначе
			
			Возврат Истина;
			
		КонецЕсли;
		
		НачатьТранзакцию();
			
		ДокументОснование 		= Документы[ИмяДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Object.ID));
		СтатусДокументаИзWMS 	= СопоставитьСтатусWMS4_ОжидаемаяПриемка(Object.Status);
		
		// 2022.03.23 1c_dev2 [start]
		// ДатаРазгрузки (DateUnload) в Ожидаемой приемке ставится до приемки и размещения (при статусе К выполнению)
		// Она является фактом прихода груза на склад
		// Ставим статус "Разгружен", если в Object  Status = "К выполнению", иначе информация о том, что товар разгружен не актуальна,
		// т.к он либо уже принят, либо размещен
		Если  ИмяДокумента = "ЗаказПоставщику" И Object.Status = "К выполнению" И ЗначениеЗаполнено(Object.DateUnload) Тогда
		      СтатусДокументаИзWMS = Перечисления.усСтатусыДокументов.Разгружен
		КонецЕсли;
		// 2022.03.23 1c_dev2 [end]
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ax_СкладскойОрдер.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ax_СкладскойОрдер КАК ТДФ_WMS_СкладскойОрдер
		|ГДЕ
		|	ax_СкладскойОрдер.ДокументОснование = &ДокументОснование
		|	И ax_СкладскойОрдер.ВидОперации = &ВидОперации
		|	И ax_СкладскойОрдер.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументОснование"	, ДокументОснование);
		Запрос.УстановитьПараметр("ВидОперации"			, ВидОперации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументОбъект = Выборка.ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.усСтатусДокумента 	= СтатусДокументаИзWMS; // 2022.03.23 1c_dev2
			ДокументОбъект.КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
		Иначе
			ДокументОбъект 						= Документы.ax_СкладскойОрдер.СоздатьДокумент();
			ДокументОбъект.ВидОперации 			= ВидОперации;
			ДокументОбъект.Склад 				= ДокументОснование[ИмяРеквизитаСклад];
			ДокументОбъект.ДокументОснование 	= ДокументОснование;
			ДокументОбъект.усСтатусДокумента 	= СтатусДокументаИзWMS;
			ДокументОбъект.КомментарийСклад 	= ОбменДаннымиWMS4.ОбработатьКомментарий(Object.Description); // 2022.08.17 1c_dev2 записать многострочного комментария
			ДокументОбъект.Дата 				= Object.Date;
			ДокументОбъект.Номер 				= Object.Number;
		КонецЕсли;	
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		
		// 2022.04.27 1c_dev2 [start]
		// Закомментируем попытку-исключение, т.к. транзакция фиксируется даже при исключении 
		// и объект удаляется из плана обмена WMS
		//Попытка
		ДокументОбъект.Записать();
		//Исключение
		//	ЗаписьЖурналаРегистрации("WMS_СтатусДокумента", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при установке статуса: " + СокрЛП(Object.ID) + ", " + СокрЛП(ОписаниеОшибки()));
		//КонецПопытки;
		// 2022.04.27 1c_dev2 [end]
			
		ЗафиксироватьТранзакцию();
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		//ОписаниеОшибки = ОписаниеОшибки();
		// 2022.04.27 1c_dev2 К комментарию записи журнала добавлен Object.ID 
		//ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"SetDocumentStatus(): " + СокрЛП(Object.ID) + ", " + ОписаниеОшибки);
		//ЗаписатьВЖурналРегистрации("SetDocumentStatus()", Object.ID, ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбменССайтом

// Тестирование
Функция tdfort(param)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(param);
	Чтото = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат param;
	
КонецФункции

Функция tdfort_FindCompany(JSONcode)
	
	//ObjectJSON_order = JSONcode_в_Объект1С(JSONcode);
	//
	//ОтветСтруктура = Новый Структура;
	//ОтветСтруктура.Вставить("Result");  // булево
	//ОтветСтруктура.Вставить("Message"); // строка
	//ОтветСтруктура.Вставить("Found");   // массив кодов
	//
	//FoundМассив = Новый Массив();
	//MessageТекст = "";
	//companyData = ObjectJSON_order.companyData;
	//
	//Код = Формат(ObjectJSON_order.companyData.companyId_1C,"ЧГ=");
	//ИНН = Формат(ObjectJSON_order.companyData.companyData.inn,"ЧГ=");
	//КПП = Формат(ObjectJSON_order.companyData.companyData.kpp,"ЧГ=");
	//
	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");

	//// проверяем есть ли в базе контрагент с таким ИНН
	//
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Контрагенты.Ссылка,
	//|	Контрагенты.ИНН,
	//|	Контрагенты.КПП,
	//|	Контрагенты.Код,
	//|	Контрагенты.Покупатель,
	//|	Контрагенты.Поставщик,
	//|	Контрагенты.ЮрФизЛицо,
	//|	Контрагенты.ОбособленноеПодразделение
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Справочник.Контрагенты КАК Контрагенты
	//|ГДЕ
	//|	Контрагенты.ИНН = &ИНН
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Ссылка,
	//|	ВТ.ИНН,
	//|	ВТ.КПП,
	//|	ВТ.Код,
	//|	ВТ.Покупатель,
	//|	ВТ.Поставщик,
	//|	ВТ.ЮрФизЛицо
	//|ИЗ
	//|	ВТ КАК ВТ";
	//
	//Запрос.УстановитьПараметр("ИНН", ИНН);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда // в базе не ни одного контрагента с таким ИНН, позже будем создавать
	//	
	//	ОтветСтруктура.Вставить("Result",Ложь);
	//	ОтветСтруктура.Вставить("Found",FoundМассив);
	//	
	//Иначе                                // в базе есть контрагент(ы) с таким ИНН
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда // в базе один контрагент с входящим ИНН
	//		
	//		ВыборкаДетальныеЗаписи.Следующий();
	//		
	//		ЭлементМассиваFound = Новый Структура();
	//		ЭлементМассиваFound.Вставить("type","company_ul");
	//		ЭлементМассиваFound.Вставить("tdf_id",companyData.companyId);
	//		ЭлементМассиваFound.Вставить("_1c_id",ВыборкаДетальныеЗаписи.Код);
	//		ЭлементМассиваFound.Вставить("_1c_type_id");
	//		ЭлементМассиваFound.Вставить("_1c_kind_id");
	//		FoundМассив.Добавить(ЭлементМассиваFound);
	//		
	//		ОтветСтруктура.Вставить("Result",Истина);
	//		ОтветСтруктура.Вставить("Found",FoundМассив);
	//		
	//		Если ВыборкаДетальныеЗаписи.КПП = КПП Тогда  // у найденного контрагента совпадает КПП с входящим
	//			ОтветСтруктура.Вставить("Message","");
	//		Иначе                                        // у найденного контрагента не совпадает КПП с входящим
	//			ОтветСтруктура.Вставить("Message","При оформлении заказа был выбран контрагент у которого другой КПП по сравнению с данными переданными от my.tdfort.ru. Проверьте правильность.");
	//		КонецЕсли;
	//		
	//	Иначе                                              // в базе больше чем один контранент с входящим ИНН

	//		// проверяем сколько контрагентов в базе есть с входящим КПП
	//		// варианты
	//		// 1) ни одного: 		инн1 кпп2, инн1 кпп3
	//		// 2) один: 			инн1 кпп1, инн1 кпп2
	//		// 3) больше чем один: 	инн1 кпп1, инн1 кпп1
	//		
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ВТ.Ссылка, ВТ.ИНН, ВТ.КПП, ВТ.Код
	//		|ИЗ
	//		|	ВТ КАК ВТ
	//		|ГДЕ
	//		|	ВТ.КПП = &КПП";
	//		
	//		Запрос.УстановитьПараметр("КПП", КПП);
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		Если РезультатЗапроса.Пустой() Тогда // в базе есть несколько контрагентов с таким ИНН 
	//											 // и ни одного с таким же КПП
	//										 	 // проверим на совпадение кода
	//			Запрос.Текст = 
	//			"ВЫБРАТЬ 
	//			|	ВТ.Ссылка,
	//			|	ВТ.ИНН,
	//			|	ВТ.КПП,
	//			|	ВТ.Код
	//			|ИЗ
	//			|	ВТ КАК ВТ
	//			|ГДЕ
	//			|	ВТ.Код = &Код
	//			|";
	//			
	//			Запрос.УстановитьПараметр("Код", Код);
	//			РезультатЗапроса = Запрос.Выполнить();
	//			
	//			Если Не РезультатЗапроса.Пустой() Тогда // есть совпадение по коду 
	//				
	//				ЭлементМассиваFound = Новый Структура();
	//				ЭлементМассиваFound.Вставить("type","company_ul");
	//				ЭлементМассиваFound.Вставить("tdf_id",companyData.companyId);
	//				ЭлементМассиваFound.Вставить("_1c_id",ВыборкаДетальныеЗаписи.Код);
	//				ЭлементМассиваFound.Вставить("_1c_type_id");
	//				ЭлементМассиваFound.Вставить("_1c_kind_id");
	//				FoundМассив.Добавить(ЭлементМассиваFound);
	//				
	//				ОтветСтруктура.Вставить("Result",Истина);
	//				ОтветСтруктура.Вставить("Found",FoundМассив);
	//				ОтветСтруктура.Вставить("Message","При оформлении заказа был выбран контрагент у которого другой КПП по сравнению с данными переданными от my.tdfort.ru. Проверьте правильность.");
	//				
	//			Иначе									// нет совпадения по коду
	//				
	//				// берем первого контрагента из базы из списка который упорядочен  
	//				// 1) юр лицо(не филиал), покупатель
	//				// 2) обособленное подразделение, покупатель
	//				// 3) юр лицо(не филиал), поставщик
	//				// если в любом из пунктов будет более чем 1 элемент, то первый попавшийся
	//				
	//				Запрос.Текст = 
	//				"ВЫБРАТЬ ПЕРВЫЕ 1
	//				|	ВТ.Ссылка,
	//				|	ВТ.ИНН,
	//				|	ВТ.КПП,
	//				|	ВТ.Код,
	//				|	ВТ.Покупатель КАК Покупатель,
	//				|	ВТ.Поставщик КАК Поставщик,
	//				|	ВТ.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	//				|	ВТ.ЮрФизЛицо,
	//				|	ВЫБОР
	//				|		КОГДА ВТ.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	//				|				И НЕ ВТ.ОбособленноеПодразделение
	//				|				И ВТ.Покупатель
	//				|			ТОГДА 1
	//				|		КОГДА ВТ.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	//				|				И ВТ.ОбособленноеПодразделение
	//				|				И ВТ.Покупатель
	//				|			ТОГДА 2
	//				|		КОГДА ВТ.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	//				|				И НЕ ВТ.ОбособленноеПодразделение
	//				|				И ВТ.Поставщик
	//				|			ТОГДА 3
	//				|		ИНАЧЕ 4
	//				|	КОНЕЦ КАК Вес
	//				|ИЗ
	//				|	ВТ КАК ВТ
	//				|
	//				|УПОРЯДОЧИТЬ ПО
	//				|	Вес";
	//				
	//				РезультатЗапроса = Запрос.Выполнить();
	//				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//				ВыборкаДетальныеЗаписи.Следующий();

	//				ЭлементМассиваFound = Новый Структура();
	//				ЭлементМассиваFound.Вставить("type","company_ul");
	//				ЭлементМассиваFound.Вставить("tdf_id",companyData.companyId);
	//				ЭлементМассиваFound.Вставить("_1c_id",ВыборкаДетальныеЗаписи.Код);
	//				ЭлементМассиваFound.Вставить("_1c_type_id");
	//				ЭлементМассиваFound.Вставить("_1c_kind_id");
	//				FoundМассив.Добавить(ЭлементМассиваFound);

	//				ОтветСтруктура.Вставить("Result",Истина);
	//				ОтветСтруктура.Вставить("Found",FoundМассив);
	//				ОтветСтруктура.Вставить("Message","При оформлении заказа был выбран контрагент у которого другой КПП по сравнению с данными переданными от my.tdfort.ru. Проверьте правильность.");					
	//				
	//			КонецЕсли;
	//			
	//		Иначе                            // в базе есть несколько контрагентов с таким ИНН 
	//										 // и один или несколько с таким же КПП
	//											 
	//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		
	//			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда // в базе один контрагент с входящим ИНН,КПП
	//				
	//				ВыборкаДетальныеЗаписи.Следующий();
	//				ЭлементМассиваFound = Новый Структура();
	//				ЭлементМассиваFound.Вставить("type","company_ul");
	//				ЭлементМассиваFound.Вставить("tdf_id",companyData.companyId);
	//				ЭлементМассиваFound.Вставить("_1c_id",ВыборкаДетальныеЗаписи.Код);
	//				ЭлементМассиваFound.Вставить("_1c_type_id");
	//				ЭлементМассиваFound.Вставить("_1c_kind_id");
	//				FoundМассив.Добавить(ЭлементМассиваFound);
	//				
	//				ОтветСтруктура.Вставить("Result",Истина);
	//				ОтветСтруктура.Вставить("Found",FoundМассив);
	//				ОтветСтруктура.Вставить("Message","");					
	//				
	//			Иначе                                              // в базе несколько контранентов с входящим ИНН,КПП
	//							 								   // проверим на совпадение кода
	//				Запрос.Текст = 
	//				"ВЫБРАТЬ 
	//				|	ВТ.Ссылка,
	//				|	ВТ.ИНН,
	//				|	ВТ.КПП,
	//				|	ВТ.Код
	//				|ИЗ
	//				|	ВТ КАК ВТ
	//				|ГДЕ
	//				|	ВТ.Код = &Код
	//				|";
	//				
	//				Запрос.УстановитьПараметр("Код", Код);
	//				РезультатЗапроса = Запрос.Выполнить();
	//									
	//				Если Не РезультатЗапроса.Пустой() Тогда // есть совпадение по коду 
	//					
	//					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//					ВыборкаДетальныеЗаписи.Следующий();
	//					
	//					ЭлементМассиваFound = Новый Структура();
	//					ЭлементМассиваFound.Вставить("type","company_ul");
	//					ЭлементМассиваFound.Вставить("tdf_id",companyData.companyId);
	//					ЭлементМассиваFound.Вставить("_1c_id",ВыборкаДетальныеЗаписи.Код);
	//					ЭлементМассиваFound.Вставить("_1c_type_id");
	//					ЭлементМассиваFound.Вставить("_1c_kind_id");
	//					FoundМассив.Добавить(ЭлементМассиваFound);
	//					
	//					ОтветСтруктура.Вставить("Result",Истина);
	//					ОтветСтруктура.Вставить("Found",FoundМассив);
	//					ОтветСтруктура.Вставить("Message","");					
	//					
	//				Иначе									// нет совпадения по коду
	//					
	//					Запрос.Текст = 
	//					"ВЫБРАТЬ ПЕРВЫЕ 1
	//					|	ВТ.Ссылка,
	//					|	ВТ.Покупатель КАК Покупатель,
	//					|	ВТ.Поставщик КАК Поставщик
	//					|ИЗ
	//					|	ВТ КАК ВТ
	//					|
	//					|УПОРЯДОЧИТЬ ПО
	//					|	Покупатель УБЫВ,
	//					|	Поставщик УБЫВ";
	//					
	//					РезультатЗапроса = Запрос.Выполнить();
	//					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//					ВыборкаДетальныеЗаписи.Следующий();
	//					
	//					ЭлементМассиваFound = Новый Структура();
	//					ЭлементМассиваFound.Вставить("type","company_ul");
	//					ЭлементМассиваFound.Вставить("tdf_id",companyData.companyId);
	//					ЭлементМассиваFound.Вставить("_1c_id",ВыборкаДетальныеЗаписи.Код);
	//					ЭлементМассиваFound.Вставить("_1c_type_id");
	//					ЭлементМассиваFound.Вставить("_1c_kind_id");
	//					FoundМассив.Добавить(ЭлементМассиваFound);
	//					
	//					ОтветСтруктура.Вставить("Result",Истина);
	//					ОтветСтруктура.Вставить("Found",FoundМассив);
	//					ОтветСтруктура.Вставить("Message","При оформлении заказа был выбран контрагент у которого другой КПП по сравнению с данными переданными от my.tdfort.ru. Проверьте правильность.");					
	//					
	//					
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(ОтветСтруктура);
	//
	//Возврат JSONcode;
		
КонецФункции

Функция tdfort_createFL(JSONcode)
	
	////{"user_data":{"region":{},"user":{"avatar":"https://lh3.googleusercontent.com/a/AATXAJxSGthvLAo9QBiQzaQ0g0XGlBL_QMvXPiYcxOk=s96-c","name":"Илья","lastname":"Чернов","userId":13500,"phones":[79643332227],"emails":["scrache@gmail.com"]},"awards":0,"companies":[]}}
	//
	//userData = JSONcode_в_Объект1С(JSONcode);
	//
	//ОтветСтруктура = Новый Структура("Result, Message, Created");
	//CreatedМассив = Новый Массив();
	//
	//Если Не userData.user_data.user.Свойство("userId") Тогда
	//
	//	ОтветСтруктура.Вставить("Result",Ложь);		
	//	ОтветСтруктура.Вставить("Message", "В передаваемых данных нет userId");
	//	ОтветСтруктура.Вставить("Created", CreatedМассив);
	//
	//Иначе
	//	
	//	// изменим поиск контрагента с ФИО на совпадение контактной информации
	//	
	//	МассивЭлАдресов = userData.user_data.user.emails;
	//	МассивТелефонов = userData.user_data.user.phones;
	//	
	//	ТекстЗапроса = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)) КАК Поле1,
	//	|	КонтактнаяИнформация.Объект КАК Объект,
	//	|	КонтактнаяИнформация.Объект.Код КАК ОбъектКод
	//	|ИЗ
	//	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//	|ГДЕ
	//	|	КонтактнаяИнформация.Тип = &Тип
	//	|	И ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)) В (&МассивПредставлений)
	//	|	И КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ОбъектКод УБЫВ";
	//	
	//	
	//	НашлиСуществующего = Ложь;
	//	
	//	// первая проверка: на эл адреса
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = ТекстЗапроса;

	//	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);		
	//	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
	//	Запрос.УстановитьПараметр("МассивПредставлений",МассивЭлАдресов);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		ВыборкаДетальныеЗаписи.Следующий();

	//		ОбнаруженнаяЗаписьКод = ВыборкаДетальныеЗаписи.ОбъектКод;
	//		НашлиСуществующего = Истина;

	//		ЭлементМассиваCreated = Новый Структура();
	//		ЭлементМассиваCreated.Вставить("type","company_fl");
	//		ЭлементМассиваCreated.Вставить("tdf_id",userData.user_data.user.userId);
	//		ЭлементМассиваCreated.Вставить("_1c_id",ОбнаруженнаяЗаписьКод);
	//		ЭлементМассиваCreated.Вставить("_1c_type_id");
	//		ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//		CreatedМассив.Добавить(ЭлементМассиваCreated);
	//		
	//		ОтветСтруктура.Вставить("Result",Ложь);		
	//		ОтветСтруктура.Вставить("Message", "В базе данных уже есть контрагент с передаваемыми эл. адресами: " + ОбнаруженнаяЗаписьКод);
	//		ОтветСтруктура.Вставить("Created", CreatedМассив);

	//	КонецЕсли;	
	//	
	//	
	//	// вторая проверка: на телефоны
	//	Если Не НашлиСуществующего Тогда
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = ТекстЗапроса;

	//		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);		
	//		Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
	//		Запрос.УстановитьПараметр("МассивПредставлений",МассивТелефонов);
	//		
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		Если НЕ РезультатЗапроса.Пустой() Тогда
	//			
	//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//			ВыборкаДетальныеЗаписи.Следующий();

	//			ОбнаруженнаяЗаписьКод = ВыборкаДетальныеЗаписи.ОбъектКод;
	//			НашлиСуществующего = Истина;
	//			
	//			ЭлементМассиваCreated = Новый Структура();
	//			ЭлементМассиваCreated.Вставить("type","company_fl");
	//			ЭлементМассиваCreated.Вставить("tdf_id",userData.user_data.user.userId);
	//			ЭлементМассиваCreated.Вставить("_1c_id",ОбнаруженнаяЗаписьКод);
	//			ЭлементМассиваCreated.Вставить("_1c_type_id");
	//			ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//			CreatedМассив.Добавить(ЭлементМассиваCreated);
	//			
	//			ОтветСтруктура.Вставить("Result",Ложь);		
	//			ОтветСтруктура.Вставить("Message", "В базе данных уже есть контрагент с передаваемыми телефонами: " + ОбнаруженнаяЗаписьКод);
	//			ОтветСтруктура.Вставить("Created", CreatedМассив);
	//			
	//		КонецЕсли;	
	//		
	//	КонецЕсли;
	//	
	//	Если Не НашлиСуществующего Тогда

	//		Попытка

	//			СтруктураДанныхКонтрагента = Новый Структура("Фамилия,Имя,Отчество",userData.user_data.user.lastname,userData.user_data.user.name);
	//			СтрокаФИО = ТДФВспомогательный.ПолучитьПоСтруктуреСтрокиСФИО(СтруктураДанныхКонтрагента);
	//			
	//			НачатьТранзакцию();
	//			
	//			НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	//			НовыйКонтрагент.УстановитьНовыйКод();
	//			НовыйКонтрагент.Родитель 	= Константы.ТДФ_ПапкаДляФизЛиц.Получить();
	//			
	//			НовыйКонтрагент.Наименование 		= СтрокаФИО;
	//			НовыйКонтрагент.НаименованиеПолное	= СтрокаФИО;
	//			
	//			НовыйКонтрагент.Покупатель = Истина;
	//			НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
	//			НовыйКонтрагент.ФондПоУмолчанию = Справочники.ТДФФонды.НайтиПоНаименованию("_Оплата от покупателя", Истина);
	//			
	//			НовыйКонтрагент.Комментарий = "создан по запросу с веб сервера " + ТекущаяДата();	
	//			НовыйКонтрагент.ОбменДанными.Загрузка = Истина;
	//			НовыйКонтрагент.ТДФ_ФизЛицо = Истина;
	//			
	//			НовыйКонтрагент.Записать();
	//			
	//			// Создать договор
	//			ТДФВспомогательный.ПроверитьОсновнойДоговорКонтрагента(НовыйКонтрагент);
	//			
	//			КонтрагентСсылка = НовыйКонтрагент.Ссылка;
	//			
	//			ЭлементМассиваCreated = Новый Структура();
	//			ЭлементМассиваCreated.Вставить("type","company_fl");
	//			ЭлементМассиваCreated.Вставить("tdf_id",userData.user_data.user.userId);
	//			ЭлементМассиваCreated.Вставить("_1c_id",КонтрагентСсылка.Код);
	//			ЭлементМассиваCreated.Вставить("_1c_type_id");
	//			ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//			CreatedМассив.Добавить(ЭлементМассиваCreated);
	//			
	//			//запись электронного адреса
	//			
	//			НаборЗаписейРегистра = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();		
	//			НаборЗаписейРегистра.Отбор.Объект.Установить(КонтрагентСсылка);
	//			НаборЗаписейРегистра.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	//			
	//			НаборЗаписейРегистра.Очистить();
	//			
	//			ТекстЗапроса = 
	//			"ВЫБРАТЬ
	//			|	ВидыКонтактнойИнформации.Ссылка,
	//			|	ВидыКонтактнойИнформации.Код
	//			|ИЗ
	//			|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	//			|ГДЕ
	//			|	ВидыКонтактнойИнформации.Тип = &Тип
	//			|	И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	//			|	И ВидыКонтактнойИнформации.Код В(&МассивКодов)";
	//			
	//			Запрос = Новый Запрос;
	//			Запрос.Текст = ТекстЗапроса;
	//			
	//			МассивКодов = Новый Массив;
	//			МассивКодов.Добавить("000007102");
	//			МассивКодов.Добавить("000007106");
	//			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);		
	//			Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
	//			Запрос.УстановитьПараметр("МассивКодов",МассивКодов);
	//			
	//			СписокВидовКонтактнойИнформации = Новый СписокЗначений;
	//			
	//			РезультатЗапроса = Запрос.Выполнить();
	//			
	//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//			
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				СписокВидовКонтактнойИнформации.Добавить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Код);
	//			КонецЦикла;
	//			
	//			Для индекс = 0 По userData.user_data.user.emails.ВГраница() Цикл
	//				СтрокаНабора = НаборЗаписейРегистра.Добавить();
	//				СтрокаНабора.Объект = КонтрагентСсылка;
	//				СтрокаНабора.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	//				СтрокаНабора.Вид = СписокВидовКонтактнойИнформации[индекс].Значение;
	//				СтрокаНабора.Представление = userData.user_data.user.emails[индекс];
	//				ЭлементМассиваCreated = Новый Структура();
	//				ЭлементМассиваCreated.Вставить("type","email");
	//				ЭлементМассиваCreated.Вставить("tdf_id",userData.user_data.user.userId);
	//				ЭлементМассиваCreated.Вставить("_1c_id",КонтрагентСсылка.Код);
	//				ЭлементМассиваCreated.Вставить("_1c_type_id",Строка(СтрокаНабора.Тип));
	//				ЭлементМассиваCreated.Вставить("_1c_kind_id",СписокВидовКонтактнойИнформации[индекс].Представление);
	//				CreatedМассив.Добавить(ЭлементМассиваCreated);
	//				Если индекс = СписокВидовКонтактнойИнформации.Количество()-1 Тогда
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//			НаборЗаписейРегистра.Записать();
	//			
	//			// запись телефона
	//			НаборЗаписейРегистра = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();		
	//			НаборЗаписейРегистра.Отбор.Объект.Установить(КонтрагентСсылка);
	//			НаборЗаписейРегистра.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	//			
	//			НаборЗаписейРегистра.Очистить();
	//			
	//			Запрос = Новый Запрос;
	//			Запрос.Текст = ТекстЗапроса;
	//			
	//			//Запрос.УстановитьПараметр("МассивНаименований",Новый Массив("Телефон контрагента",
	//			//																   "Телефон контрагента 1",
	//			//								   										       "Телефон контрагента 2",
	//			// 															  							   "Телефон контрагента 3",
	//			//																									   "Телефон контрагента 4",
	//			//																												   "Телефон контрагента 5",
	//			//																														       "Телефон контрагента 6",  
	//			//Запрос.УстановитьПараметр("МассивКодов",Новый Массив("000000005","000007080","000007077","000007062","000007035","000007036","000006624"))
	//			МассивКодов = Новый Массив;
	//			МассивКодов.Добавить("000000005");
	//			МассивКодов.Добавить("000007080");
	//			МассивКодов.Добавить("000007077");
	//			МассивКодов.Добавить("000007062");
	//			МассивКодов.Добавить("000007035");
	//			МассивКодов.Добавить("000007036");
	//			МассивКодов.Добавить("000006624");
	//			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);		
	//			Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
	//			Запрос.УстановитьПараметр("МассивКодов",МассивКодов);
	//			
	//			СписокВидовКонтактнойИнформации = Новый СписокЗначений;
	//			
	//			РезультатЗапроса = Запрос.Выполнить();
	//			
	//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//			
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				СписокВидовКонтактнойИнформации.Добавить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Код);
	//			КонецЦикла;
	//			
	//			Для индекс = 0 По userData.user_data.user.phones.ВГраница() Цикл
	//				СтрокаНабора = НаборЗаписейРегистра.Добавить();
	//				СтрокаНабора.Объект = КонтрагентСсылка;
	//				СтрокаНабора.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	//				СтрокаНабора.Вид = СписокВидовКонтактнойИнформации[индекс].Значение;
	//				СтрокаНабора.Представление = userData.user_data.user.phones[индекс];
	//				ЭлементМассиваCreated = Новый Структура();
	//				ЭлементМассиваCreated.Вставить("type","phone");
	//				ЭлементМассиваCreated.Вставить("tdf_id",userData.user_data.user.userId);
	//				ЭлементМассиваCreated.Вставить("_1c_id",КонтрагентСсылка.Код);
	//				ЭлементМассиваCreated.Вставить("_1c_type_id",Строка(СтрокаНабора.Тип));					
	//				ЭлементМассиваCreated.Вставить("_1c_kind_id",СписокВидовКонтактнойИнформации[индекс].Представление);
	//				CreatedМассив.Добавить(ЭлементМассиваCreated);
	//				Если индекс = СписокВидовКонтактнойИнформации.Количество()-1 Тогда
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//			НаборЗаписейРегистра.Записать();

	//			ЗафиксироватьТранзакцию();

	//			ОтветСтруктура.Вставить("Result", Истина);
	//			ОтветСтруктура.Вставить("Message", "Успешное создание контрагента");
	//			ОтветСтруктура.Вставить("Created", CreatedМассив);
	//			
	//		Исключение
	//			
	//			ОтменитьТранзакцию();
	//			ОписаниеОшибки = ОписаниеОшибки();
	//			ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"tdfort_createFL(): " + ОписаниеОшибки);
	//			ОтветСтруктура.Вставить("Result",Ложь);		
	//			ОтветСтруктура.Вставить("Message", "Ошибка времени выполнения");
	//			ОтветСтруктура.Вставить("Created", CreatedМассив);
	//			
	//		КонецПопытки;
	//		
	//	КонецЕсли;			

	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(ОтветСтруктура);
	//
	//Возврат JSONcode;
	
КонецФункции

Функция tdfort_createCompany(JSONcode)                                                       
	
	//// из согласования 2022.11.01	
	//// по поводу companyData.companyData и companyData.companyData.companyObjDadata
	//// в companyData.companyData передаются данные которые заполнил пользователь
	//// companyData.companyData.companyObjDadata передаются данные взятые из справочника, который возможно был заполнен ранее,а возможно не заполнен.
	//// companyData.companyData.companyObjDadata может быть пустым
	//// для формирования объектов в 1С нужно брать данные из companyData.companyData
	//// если в companyData.companyData нет данных а в companyData.companyData.companyObjDadata то это неправильность на стороне веб-сервера
	//// и об этом нужно сообщать веб-разработчикам.
	//
	//ObjectJSON = JSONcode_в_Объект1С(JSONcode);
	//
	//ОтветСтруктура = Новый Структура("Result, Message, Created");
	//CreatedМассив = Новый Массив();
	//MessageТекст = "";
	//
	//companyData = ObjectJSON.order.companyData;
	//
	//Если Не companyData.Свойство("companyId") Тогда
	//	
	//	MessageТекст = "В передаваемых данных нет companyId";
	//	ОтветСтруктура.Вставить("Result",Ложь);		
	//	ОтветСтруктура.Вставить("Message", MessageТекст);
	//	ОтветСтруктура.Вставить("Created", CreatedМассив);
	//	
	//Иначе                   
	//	
	//	Попытка
	//		
	//		НачатьТранзакцию();
	//		
	//		ИНН = companyData.companyData.inn;
	//		КПП = companyData.companyData.kpp;   
	//		
	//		ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//		КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//		
	//		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	//		НовыйКонтрагент.УстановитьНовыйКод();
	//		
	//		НовыйКонтрагент.Наименование 		= companyData.companyData.companyName;
	//		НовыйКонтрагент.НаименованиеПолное	= companyData.companyData.companyName;
	//		НовыйКонтрагент.ИНН					= ИНН;
	//		НовыйКонтрагент.КПП					= КПП;
	//		
	//		НовыйКонтрагент.Покупатель 			= Истина;
	//		НовыйКонтрагент.ЮрФизЛицо 			= Перечисления.ЮрФизЛицо.ЮрЛицо;
	//		НовыйКонтрагент.ФондПоУмолчанию 	= Справочники.ТДФФонды.НайтиПоНаименованию("_Оплата от покупателя", Истина);
	//		НовыйКонтрагент.КодПоОКПО 			= companyData.companyData.companyObjDadata.okpo;
	//		
	//		НовыйКонтрагент.Комментарий = "создан по запросу с веб сервера " + ТекущаяДата();	
	//		НовыйКонтрагент.ОбменДанными.Загрузка = Истина;
	//		НовыйКонтрагент.ТДФ_ФизЛицо = Ложь;
	//		
	//		НовыйКонтрагент.Записать();
	//		
	//		ТДФВспомогательный.ПроверитьОсновнойДоговорКонтрагента(НовыйКонтрагент);
	//		
	//		КонтрагентСсылка = НовыйКонтрагент.Ссылка;
	//		
	//		НовыйКонтрагент.ГоловнойКонтрагент = КонтрагентСсылка;
	//		НовыйКонтрагент.Записать();
	//		
	//		ЭлементМассиваCreated = Новый Структура();
	//		ЭлементМассиваCreated.Вставить("type","company_ul");
	//		ЭлементМассиваCreated.Вставить("tdf_id",companyData.companyId);
	//		ЭлементМассиваCreated.Вставить("_1c_id",КонтрагентСсылка.Код);
	//		ЭлементМассиваCreated.Вставить("_1c_type_id");
	//		ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//		CreatedМассив.Добавить(ЭлементМассиваCreated);
	//		
	//		// ЮРИДИЧЕСКИЙ АДРЕС КОНТРАГЕНТА
	//		companyData = ObjectJSON.order.companyData;				
	//		JSONcode_companyData = Объект1С_в_JSONcode(companyData);
	//		ЭлементМассиваCreated_ЮрАдрес = tdfort_createCompanyAddress(JSONcode_companyData);
	//		ЭлементМассиваCreated = JSONcode_в_Объект1С(ЭлементМассиваCreated_ЮрАдрес);
	//		
	//		Если ЗначениеЗаполнено(ЭлементМассиваCreated) Тогда
	//			CreatedМассив.Добавить(ЭлементМассиваCreated);
	//		КонецЕсли;
	//		
	//		// ТЕЛЕФОНЫ КОНТРАГЕНТА
	//		companyData = ObjectJSON.order.companyData;
	//		JSONcode_companyData = Объект1С_в_JSONcode(companyData);				
	//		// первоначальное написание имени массива
	//		//МассивСозданных_Тел = tdfort_createCompanyPhone(JSONcode_companyData);
	//		//МассивСозданных = JSONcode_в_Объект1С(МассивСозданных_Тел);
	//		МассивСозданных_Телефонов = tdfort_createCompanyPhone(JSONcode_companyData);
	//		МассивСозданных = JSONcode_в_Объект1С(МассивСозданных_Телефонов);				
	//		
	//		Для Каждого Стр Из МассивСозданных Цикл
	//			Если ЗначениеЗаполнено(Стр) Тогда
	//				CreatedМассив.Добавить(Стр);		
	//			КонецЕсли;	
	//		КонецЦикла;
	//		
	//		// КОНТАКТНОЕ ЛИЦО КОНТРАГЕНТА
	//		order = ObjectJSON.order;
	//		JSONcode_order = Объект1С_в_JSONcode(order);
	//		ЭлементМассиваCreated_КонтактноеЛицоКонтрагента = tdfort_createCompanyContact(JSONcode_order);
	//		ЭлементМассиваCreated = JSONcode_в_Объект1С(ЭлементМассиваCreated_КонтактноеЛицоКонтрагента);
	//		
	//		Если ЗначениеЗаполнено(ЭлементМассиваCreated) Тогда
	//			CreatedМассив.Добавить(ЭлементМассиваCreated);
	//		КонецЕсли;
	//		
	//		// ЭЛЕКТРОННЫЕ ПОЧТЫ КОНТАКТНЫХ ЛИЦ КОНТРАГЕНТА
	//		order = ObjectJSON.order;
	//		JSONcode_order = Объект1С_в_JSONcode(order);
	//		МассивСозданных_email = tdfort_createEmail(JSONcode_order);
	//		МассивСозданных = JSONcode_в_Объект1С(МассивСозданных_email);
	//		
	//		Для Каждого Стр Из МассивСозданных Цикл
	//			Если ЗначениеЗаполнено(Стр) Тогда
	//				CreatedМассив.Добавить(Стр);		
	//			КонецЕсли;	
	//		КонецЦикла;
	//		
	//		// ТЕЛЕФОНЫ КОНТАКТНЫХ ЛИЦ КОНТРАГЕНТА
	//		order = ObjectJSON.order;
	//		JSONcode_order = Объект1С_в_JSONcode(order);
	//		МассивСозданных_телефонов = tdfort_createPhone(JSONcode_order);
	//		МассивСозданных = JSONcode_в_Объект1С(МассивСозданных_телефонов);
	//		
	//		Для Каждого Стр Из МассивСозданных Цикл
	//			Если ЗначениеЗаполнено(Стр) Тогда
	//				CreatedМассив.Добавить(Стр);		
	//			КонецЕсли;	
	//		КонецЦикла;
	//		
	//		// запись электронного адреса
	//		Если ТипЗнч(companyData.companyData.companyObjDadata.emails) = Тип("Массив") Тогда
	//			
	//			НаборЗаписейРегистра = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();		
	//			НаборЗаписейРегистра.Отбор.Объект.Установить(КонтрагентСсылка);
	//			НаборЗаписейРегистра.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	//			
	//			НаборЗаписейРегистра.Очистить();
	//			
	//			ТекстЗапроса = 
	//			"ВЫБРАТЬ
	//			|	ВидыКонтактнойИнформации.Ссылка,
	//			|	ВидыКонтактнойИнформации.Код
	//			|ИЗ
	//			|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	//			|ГДЕ
	//			|	ВидыКонтактнойИнформации.Тип = &Тип
	//			|	И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	//			|	И ВидыКонтактнойИнформации.Код В(&МассивКодов)";
	//			
	//			Запрос = Новый Запрос;
	//			Запрос.Текст = ТекстЗапроса;
	//			
	//			МассивКодов = Новый Массив;
	//			МассивКодов.Добавить("000007102");
	//			МассивКодов.Добавить("000007106");
	//			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);		
	//			Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
	//			Запрос.УстановитьПараметр("МассивКодов",МассивКодов);
	//			
	//			СписокВидовКонтактнойИнформации = Новый СписокЗначений;
	//			
	//			РезультатЗапроса = Запрос.Выполнить();
	//			
	//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//			
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				СписокВидовКонтактнойИнформации.Добавить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Код);
	//			КонецЦикла;
	//			
	//			Для индекс = 0 По companyData.companyData.companyObjDadata.emails.ВГраница() Цикл
	//				СтрокаНабора = НаборЗаписейРегистра.Добавить();
	//				СтрокаНабора.Объект = КонтрагентСсылка;
	//				СтрокаНабора.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	//				СтрокаНабора.Вид = СписокВидовКонтактнойИнформации[индекс].Значение;
	//				СтрокаНабора.Представление = companyData.companyData.companyObjDadata.emails[индекс];
	//				ЭлементМассиваCreated = Новый Структура();
	//				ЭлементМассиваCreated.Вставить("type","email");
	//				ЭлементМассиваCreated.Вставить("tdf_id",companyData.companyId);
	//				ЭлементМассиваCreated.Вставить("_1c_id",КонтрагентСсылка.Код);
	//				ЭлементМассиваCreated.Вставить("_1c_type_id",Строка(СтрокаНабора.Тип));
	//				ЭлементМассиваCreated.Вставить("_1c_kind_id",СписокВидовКонтактнойИнформации[индекс].Представление);
	//				CreatedМассив.Добавить(ЭлементМассиваCreated);
	//				Если индекс = СписокВидовКонтактнойИнформации.Количество()-1 Тогда
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//			НаборЗаписейРегистра.Записать();
	//			
	//		КонецЕсли;
	//		
	//		// ЗАПОЛНИТЬ БАНКОВСКИЕ РЕКВИЗИТЫ
	//		companyData = ObjectJSON.order.companyData;
	//		JSONcode_companyData = Объект1С_в_JSONcode(companyData);
	//		ЭлементМассиваCreated_BankAccount = tdfort_createCompanyBankAccount(JSONcode_companyData);
	//		ЭлементМассиваCreated = JSONcode_в_Объект1С(ЭлементМассиваCreated_BankAccount);
	//		
	//		Если ЗначениеЗаполнено(ЭлементМассиваCreated) Тогда
	//			
	//			CreatedМассив.Добавить(ЭлементМассиваCreated);
	//			
	//			ЗафиксироватьТранзакцию();
	//			
	//			MessageТекст = "Успешное создание контрагента";
	//			ОтветСтруктура.Вставить("Result",Истина);		
	//			ОтветСтруктура.Вставить("Message", MessageТекст);
	//			ОтветСтруктура.Вставить("Created", CreatedМассив);
	//			
	//		Иначе 
	//			
	//			ОтменитьТранзакцию();
	//			ОтветСтруктура.Вставить("Result",Ложь);		
	//			ОтветСтруктура.Вставить("Message", MessageТекст);
	//			ОтветСтруктура.Вставить("Created", CreatedМассив);
	//		КонецЕсли;
	//		
	//	Исключение
	//		
	//		ОтменитьТранзакцию();
	//		ОписаниеОшибки = ОписаниеОшибки();
	//		ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"tdfort_createCompany(): " + ОписаниеОшибки);
	//		ОтветСтруктура.Вставить("Result",Ложь);		
	//		ОтветСтруктура.Вставить("Message", "Ошибка времени выполнения");
	//		ОтветСтруктура.Вставить("Created", CreatedМассив);
	//		
	//	КонецПопытки;
	//	
	//КонецЕсли;			
	//
	//JSONcode = Объект1С_в_JSONcode(ОтветСтруктура);
	//
	//Возврат JSONcode;
	
КонецФункции

Функция tdfort_createCompanyBankAccount(JSONcode)
	
	//companyData = JSONcode_в_Объект1С(JSONcode);
	//
	//ЭлементМассиваCreated = Новый Структура();
	//
	//ИНН = companyData.companyData.inn;
	//КПП = companyData.companyData.kpp;

	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//
	//НайденныйКонтрагент = Контрагент_по_ИНН_КПП(ИНН,КПП);
	//
	//Если НайденныйКонтрагент <> Неопределено Тогда 
	//	
	//	ПроверкаБИКДевятьЗнаков = Истина;
	//	ПроверкаЕстьТакойБИК = Истина;				
	//	
	//	НовыйБанковскийСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	//	НовыйБанковскийСчет.УстановитьНовыйКод();
	//	
	//	БИК = companyData.bankAccountData.bankObjDadata.data.bic;
	//	Если СтрДлина(БИК) = 9 Тогда 
	//	ИначеЕсли СтрДлина(БИК) = 8 Тогда
	//		БИК  = "0" + БИК;
	//	Иначе
	//		// таких биков не должно быть, банковский счет создавать не будем
	//		ПроверкаБИКДевятьЗнаков = Ложь;
	//		MessageТекст = "В передаваемых данных БИК содержит неверное количество знаков: " + СтрДлина(БИК);
	//	КонецЕсли;
	//	
	//	Если ПроверкаБИКДевятьЗнаков Тогда
	//		
	//		Банк = Справочники.Банки.НайтиПоКоду(БИК);
	//		Если НЕ ЗначениеЗаполнено(Банк) Тогда
	//			MessageТекст = "По передаваемому БИКу не нашелся банк";
	//			ПроверкаЕстьТакойБИК = Ложь;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если ПроверкаБИКДевятьЗнаков И ПроверкаЕстьТакойБИК Тогда
	//		
	//		НомерСчета = companyData.bankAccountData.rSch;
	//		НовыйБанковскийСчет.Банк 		= Банк;
	//		НовыйБанковскийСчет.НомерСчета 	= НомерСчета;
	//		НовыйБанковскийСчет.ВидСчета 	= "Расчетный";
	//		НовыйБанковскийСчет.Владелец	= НайденныйКонтрагент;
	//		НовыйБанковскийСчет.ВалютаДенежныхСредств = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	//		НовыйБанковскийСчет.Наименование = Лев(НомерСчета + ?(НЕ Банк.Пустая(), ", " + Банк, ""), 100);
	//		
	//		НовыйБанковскийСчет.Записать();
	//		
	//		ЭлементМассиваCreated = Новый Структура();
	//		ЭлементМассиваCreated.Вставить("type","bankAccount");
	//		ЭлементМассиваCreated.Вставить("tdf_id",companyData.bankAccountId);
	//		ЭлементМассиваCreated.Вставить("_1c_id",НовыйБанковскийСчет.Код);
	//		ЭлементМассиваCreated.Вставить("_1c_type_id");
	//		ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ЭлементМассиваCreated_BankAccount = Объект1С_в_JSONcode(ЭлементМассиваCreated);
	//
	//Возврат ЭлементМассиваCreated_BankAccount;
	
КонецФункции

Функция tdfort_createCompanyAddress(JSONcode) 
	
	//companyData = JSONcode_в_Объект1С(JSONcode);
	//
	//ЭлементМассиваCreated = Новый Структура;

	//ИНН = companyData.companyData.inn;
	//КПП = companyData.companyData.kpp;

	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//
	//НайденныйКонтрагент = Контрагент_по_ИНН_КПП(ИНН,КПП);
	//
	//Если НайденныйКонтрагент <> Неопределено Тогда 
	//	
	//	ЮрАдрес = companyData.companyData.companyObjDadata.address.unrestricted_value;
	//	
	//	Если ЗначениеЗаполнено(ЮрАдрес) Тогда
	//		ЭлементМассиваCreated = ТДФВспомогательный.ЗаполнитьЮридическийАдресКонтрагента(НайденныйКонтрагент, ЮрАдрес);	
	//	КонецЕсли;
	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(ЭлементМассиваCreated);
	//
	//Возврат JSONcode;
	
КонецФункции

Функция tdfort_createCompanyPhone(JSONcode)
	
	//companyData = JSONcode_в_Объект1С(JSONcode);
	//	
	//МассивСозданных = Новый Массив();
	//
	//ИНН = companyData.companyData.inn;
	//КПП = companyData.companyData.kpp;   
	//
	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//
	//НайденныйКонтрагент = Контрагент_по_ИНН_КПП(ИНН,КПП);
	//
	//Если НайденныйКонтрагент <> Неопределено Тогда
	//	
	//	ТелефоныКонтрагента = companyData.companyData.companyObjDadata.phones;
	//	
	//	Если ЗначениеЗаполнено(ТелефоныКонтрагента) Тогда
	//		// массив структур
	//		i = 0;
	//		Пока i <= ТелефоныКонтрагента.Количество()-1 Цикл
	//			Если ЗначениеЗаполнено(ТелефоныКонтрагента[i].value) Тогда
	//				ТелефонКонтрагента = ТелефоныКонтрагента[i].value;	
	//				ЭлементМассиваCreated = ТДФВспомогательный.ЗаполнитьТелефонКонтрагента(НайденныйКонтрагент, ТелефонКонтрагента, i);
	//				i = i + 1;
	//				
	//				МассивСозданных.Добавить(ЭлементМассиваCreated);
	//				
	//			КонецЕсли;	
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(МассивСозданных);
	//
	//Возврат JSONcode;
	
КонецФункции

Функция tdfort_createCompanyContact(JSONcode)
	
	//order = JSONcode_в_Объект1С(JSONcode);
	//
	//ЭлементМассиваCreated = Новый Структура;
	//
	//ИНН = order.companyData.companyData.inn;
	//КПП = order.companyData.companyData.kpp;

	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//
	//НайденныйКонтрагент = Контрагент_по_ИНН_КПП(ИНН,КПП);
	//
	//Если НайденныйКонтрагент <> Неопределено Тогда
	//	
	//	Имя = order.userData.user_data.user.name;
	//	Фамилия = order.userData.user_data.user.lastname;
	//	
	//	Если ЗначениеЗаполнено(Имя) ИЛИ ЗначениеЗаполнено(Фамилия) Тогда
	//		ИмяФамилия = СокрЛП(Имя + " " + Фамилия);	
	//		ЭлементМассиваCreated = ТДФВспомогательный.СоздатьКонтактноеЛицоКонтрагента(НайденныйКонтрагент, ИмяФамилия);	
	//	КонецЕсли;
	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(ЭлементМассиваCreated);
	//
	//Возврат JSONcode;

КонецФункции

Функция tdfort_createEmail(JSONcode)
	
	//order = JSONcode_в_Объект1С(JSONcode);

	//МассивСозданных = Новый Массив();
	//
	//ИНН = order.companyData.companyData.inn;
	//КПП = order.companyData.companyData.kpp;

	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//
	//НайденныйКонтрагент = Контрагент_по_ИНН_КПП(ИНН,КПП);
	//
	//Если НайденныйКонтрагент <> Неопределено Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	КонтактныеЛицаКонтрагентов.Ссылка
	//	|ИЗ
	//	|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	//	|ГДЕ
	//	|	КонтактныеЛицаКонтрагентов.Владелец = &Контрагент";
	//	
	//	Запрос.УстановитьПараметр("Контрагент", НайденныйКонтрагент);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаКЛК = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаКЛК.Следующий() Тогда 
	//		
	//		КЛК = ВыборкаКЛК.Ссылка;
	//		
	//		emails = order.userData.user_data.user.emails;
	//		
	//		Если ЗначениеЗаполнено(emails) Тогда
	//			// массив
	//			i = 0;
	//			Если emails.Количество() = 1 Тогда
	//				Почта = emails[0];
	//				ЭлементМассиваCreated = ТДФВспомогательный.ЗаполнитьЭлектроннуюПочтуКонтактногоЛицаКонтрагента(КЛК, Почта, i);
	//				МассивСозданных.Добавить(ЭлементМассиваCreated);
	//			Иначе
	//				Пока i <= 1 Цикл
	//					Почта = emails[i];
	//					ЭлементМассиваCreated = ТДФВспомогательный.ЗаполнитьЭлектроннуюПочтуКонтактногоЛицаКонтрагента(КЛК, Почта, i);
	//					МассивСозданных.Добавить(ЭлементМассиваCreated);
	//					i = i + 1;
	//				КонецЦикла;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(МассивСозданных);
	//
	//Возврат JSONcode;
	
КонецФункции

Функция tdfort_createPhone(JSONcode)
	
	//order = JSONcode_в_Объект1С(JSONcode);

	//МассивСозданных = Новый Массив();
	//
	//ИНН = order.companyData.companyData.inn;
	//КПП = order.companyData.companyData.kpp;

	//ИНН = СтрЗаменить(Строка(ИНН),Символы.НПП,"");
	//КПП = ?(ЗначениеЗаполнено(КПП),СтрЗаменить(Строка(КПП),Символы.НПП,""),"");
	//
	//НайденныйКонтрагент = Контрагент_по_ИНН_КПП(ИНН,КПП);
	//
	//Если НайденныйКонтрагент <> Неопределено Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	КонтактныеЛицаКонтрагентов.Ссылка
	//	|ИЗ
	//	|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	//	|ГДЕ
	//	|	КонтактныеЛицаКонтрагентов.Владелец = &Контрагент";
	//	
	//	Запрос.УстановитьПараметр("Контрагент", НайденныйКонтрагент);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаКЛК = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаКЛК.Следующий() Тогда 
	//		
	//		КЛК = ВыборкаКЛК.Ссылка;
	//		
	//		Телефоны = order.userData.user_data.user.phones;
	//		
	//		Если ЗначениеЗаполнено(Телефоны) Тогда
	//			// массив
	//			i = 0;
	//			Если Телефоны.Количество() = 1 Тогда
	//				Телефон = Телефоны[0];
	//				ЭлементМассиваCreated = ТДФВспомогательный.ЗаполнитьТелефонКонтактногоЛицаКонтрагента(КЛК, Телефон, i);
	//				МассивСозданных.Добавить(ЭлементМассиваCreated);
	//			Иначе
	//				Пока i <= 1 Цикл
	//				Телефон = Телефоны[i];
	//				ЭлементМассиваCreated = ТДФВспомогательный.ЗаполнитьТелефонКонтактногоЛицаКонтрагента(КЛК, Телефон, i);
	//				МассивСозданных.Добавить(ЭлементМассиваCreated);
	//				i = i + 1;
	//				КонецЦикла;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(МассивСозданных);
	//
	//Возврат JSONcode;
	
КонецФункции

Функция tdfort_createRequest(JSONcode) Экспорт
	
	//// Сохранить JSONcode в РС ТДФДанныеЗаказаПокупателяССайта для отладки
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ТДФДанныеЗаказаПокупателяССайта.Период,
	//	|	ТДФДанныеЗаказаПокупателяССайта.ЗаказПокупателя,
	//	|	ТДФДанныеЗаказаПокупателяССайта.Номер КАК Номер,
	//	|	ТДФДанныеЗаказаПокупателяССайта.Данные,
	//	|	ТДФДанныеЗаказаПокупателяССайта.JSONcode
	//	|ИЗ
	//	|	РегистрСведений.ТДФДанныеЗаказаПокупателяССайта КАК ТДФДанныеЗаказаПокупателяССайта
	//	|ГДЕ
	//	|	ТДФДанныеЗаказаПокупателяССайта.Период = &Период
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Номер УБЫВ";
	//
	//Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	СвободныйНомер = ВыборкаДетальныеЗаписи.Номер + 1;
	//Иначе
	//	СвободныйНомер = 1;
	//КонецЕсли;
	//
	//НоваяЗапись = РегистрыСведений.ТДФДанныеЗаказаПокупателяССайта.СоздатьМенеджерЗаписи();
	//НоваяЗапись.Период = ТекущаяДата();	
	//НоваяЗапись.Номер = СвободныйНомер;
	//НоваяЗапись.JSONcode = Новый ХранилищеЗначения(JSONcode);
	//НоваяЗапись.Время = ТекущаяДата();
	//НоваяЗапись.Записать();	
	//
	//ObjectJSON = JSONcode_в_Объект1С(JSONcode);
	//
	//ОтветСтруктура = Новый Структура("Result, Message, Created");
	//CreatedМассив = Новый Массив();
	//MessageТекст = "";
	//Отказ = Ложь;
	//
	//Если Не ObjectJSON.order.Свойство("order_id") Тогда
	//	
	//	MessageТекст = "В передаваемых данных нет order_id";
	//	ОтветСтруктура.Вставить("Result",Ложь);		
	//	ОтветСтруктура.Вставить("Message", MessageТекст);
	//	ОтветСтруктура.Вставить("Created", CreatedМассив);
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	//
	//Если Не Отказ Тогда
	//	
	//	ТДФНомерЗаказаСайт 					= Формат(ObjectJSON.order.order_id,"ЧГ=");
	//	ДлинаРеквизитаТДФНомерЗаказаСайт	= Метаданные.Документы["ЗаказПокупателя"].Реквизиты["ТДФНомерЗаказаСайт"].Тип.КвалификаторыСтроки.Длина;
	//	ТДФНомерЗаказаСайт					= Лев("00000000000",ДлинаРеквизитаТДФНомерЗаказаСайт - СтрДлина(ТДФНомерЗаказаСайт)) + ТДФНомерЗаказаСайт;

	//	ДокументСсылка = Документы.ЗаказПокупателя.НайтиПоРеквизиту("ТДФНомерЗаказаСайт",ТДФНомерЗаказаСайт); // от Ильи, на сайте нумерация заказов сквозная, без периодов.
	//	
	//	Если ЗначениеЗаполнено(ДокументСсылка) Тогда		
	//	
	//		ЭлементМассиваCreated = Новый Структура();
	//		ЭлементМассиваCreated.Вставить("type","Request");
	//		ЭлементМассиваCreated.Вставить("tdf_id",ObjectJSON.order.order_id);
	//		ЭлементМассиваCreated.Вставить("_1c_id",ДокументСсылка.Номер);
	//		ЭлементМассиваCreated.Вставить("_1c_type_id"); 
	//		ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//		ЭлементМассиваCreated.Вставить("_1c_year",Год(ДокументСсылка.Дата));
	//		CreatedМассив.Добавить(ЭлементМассиваCreated);
	//		
	//		MessageТекст = "В базе данных уже есть заказ покупателя с передаваемым номером заказа: " + ObjectJSON.order.order_id;
	//		ОтветСтруктура.Вставить("Result",Ложь);		
	//		ОтветСтруктура.Вставить("Message", MessageТекст);
	//		ОтветСтруктура.Вставить("Created", CreatedМассив);
	//		
	//		Отказ = Истина;
	//		
	//	Иначе
	//		// документ не нашли - создаем    
	//		
	//		// проверим на наличие контрагента
	//		Если ObjectJSON.order.customer_type_id = 0 Тогда // физик
	//			
	//			Если ObjectJSON.order.Свойство("user_id") И ЗначениеЗаполнено(ObjectJSON.order.user_id) Тогда 
	//				
	//				_1c_id = Формат(ObjectJSON.order.userData.user_data.user.userId_1C,"ЧГ=");
	//				КодКонтрагента = Лев("00000000000",Метаданные.Справочники.Контрагенты.ДлинаКода - СтрДлина(_1c_id))+_1c_id;
	//				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
	//				
	//				Если Не ЗначениеЗаполнено(КонтрагентСсылка) Тогда
	//					
	//					userData = ObjectJSON.order.userData;
	//					
	//					JSONcode_userData = Объект1С_в_JSONcode(userData);
	//					
	//					ОтветСтруктура = tdfort_createFL(JSONcode_userData);	// СОЗДАТЬ КОНТРАГЕНТА ФИЗИЧЕСКОЕ ЛИЦО
	//					
	//					ObjectJSONКонтрагент = JSONcode_в_Объект1С(ОтветСтруктура);
	//					
	//					КодКонтрагента = ObjectJSONКонтрагент.Created[0]._1c_id;
	//					КонтрагентСсылка = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);

	//					// создадим ответ структуру заново
	//					ОтветСтруктура = Новый Структура("Result, Message, Created");
	//					CreatedМассив = Новый Массив(); 
	//					MessageТекст = "";

	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//				
	//		ИначеЕсли ObjectJSON.order.customer_type_id = 1 Тогда // юрик
	//			
	//			// с 2023.07, изменили логику, теперь ищем не по коду, а по ИНН, КПП и коду
	//				
	//			JSONcode_order = Объект1С_в_JSONcode(ObjectJSON.order);
	//			JSONcode_ОтветСтруктураПоиска = tdfort_FindCompany(JSONcode_order);
	//			ObjectJSONКонтрагент = JSONcode_в_Объект1С(JSONcode_ОтветСтруктураПоиска);
	//			
	//			Если ObjectJSONКонтрагент.Result Тогда
	//				КодКонтрагента = ObjectJSONКонтрагент.Found[0]._1c_id;
	//				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
	//				КомментарийПоиска = ObjectJSONКонтрагент.Message;
	//			Иначе					
	//				
	//				//ObjectJSON_ = ObjectJSON;
	//				JSONcode_ObjectJSON = Объект1С_в_JSONcode(ObjectJSON);
	//				ОтветСтруктура = tdfort_createCompany(JSONcode_ObjectJSON);	// СОЗДАТЬ КОНТРАГЕНТА ЮРИДИЧЕСКОЕ ЛИЦО
	//				ObjectJSONКонтрагент = JSONcode_в_Объект1С(ОтветСтруктура);

	//				КодКонтрагента = ObjectJSONКонтрагент.Created[0]._1c_id;
	//				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);

	//				// создадим ответ структуру заново
	//				ОтветСтруктура = Новый Структура("Result, Message, Created");
	//				CreatedМассив = Новый Массив(); 
	//				MessageТекст = "";
	//				
	//			КонецЕсли;

	//		КонецЕсли;
	//			
	//		Если Не Отказ Тогда  
	//			
	//			Попытка
	//			
	//				НачатьТранзакцию();
	//				
	//				ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
	//				ДокументОбъект.ТДФНомерЗаказаСайт = ТДФНомерЗаказаСайт;
	//				
	//				// Заполнение шапки
	//				ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"), глЗначениеПеременной("ВалютаРегламентированногоУчета"), "Продажа");
	//				
	//				//ДокументОбъект.ВалютаДокумента  = Основание.ВалютаДокумента;
	//				//ДокументОбъект.ДатаОплаты       = Основание.ДатаОплаты;
	//				//ДокументОбъект.ДатаОтгрузки     = Основание.ДатаОтгрузки;
	//				ДокументОбъект.Контрагент                        = КонтрагентСсылка;
	//				ДокументОбъект.ДоговорКонтрагента                = КонтрагентСсылка.ОсновнойДоговорКонтрагента;
	//				//ДокументОбъект.ИспользоватьПлановуюСебестоимость = Основание.ИспользоватьПлановуюСебестоимость;
	//				//ДокументОбъект.ИтогПлановаяСебестоимость         = Основание.ИтогПлановаяСебестоимость;
	//				Комментарий										= "создан по запросу с веб сервера " + ТекущаяДата();	
	//				ДокументОбъект.Комментарий                      = Комментарий + " " +ObjectJSON.order.order_comment;
	//				//ДокументОбъект.КонтактноеЛицоКонтрагента        = Основание.КонтактноеЛицоКонтрагента;
	//				//ДокументОбъект.Грузоотправитель                 = Основание.Грузоотправитель;
	//				//ДокументОбъект.Грузополучатель                  = Основание.Грузополучатель;
	//				ДокументОбъект.КратностьВзаиморасчетов  = 1;
	//				ДокументОбъект.КурсВзаиморасчетов 		= 1;
	//				Организация        						= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//				ДокументОбъект.Организация 				= Организация;
	//				ДокументОбъект.Ответственный      		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	//				//ДокументОбъект.Подразделение      		= Основание.Подразделение;
	//				ДокументОбъект.СкладГруппа        		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
	//				
	//				Если Не ЗначениеЗаполнено(ДокументОбъект.СкладГруппа) Тогда
	//					ДокументОбъект.СкладГруппа = Справочники.Склады.НайтиПоКоду("000000001");
	//				КонецЕсли;
	//				
	//				//payment_type_id = 1 - (онлайн оплата картой)
	//				//payment_type_id = 2 - (оплата через расчетный счет)
	//				//payment_type_id = 0 - (оплата в офисе, неважно картой или наличными)

	//				// пока сделаем так
	//				// назначим cтруктурной единице банковский счет в зависимости от региона
	//				// в дальнейшем возможно сделать регистр в котором хранить данные счетов в зависимости от региона

	//				//// 20220116 1с_dev2 [start]
	//				//Если ObjectJSON.order.region = "spb" тогда                        
	//				//	Запрос = Новый Запрос;
	//				//	Запрос.Текст = 
	//				//	"ВЫБРАТЬ
	//				//	|	Организации.Ссылка,
	//				//	|	Организации.ОсновнойБанковскийСчет
	//				//	|ИЗ
	//				//	|	Справочник.Организации КАК Организации
	//				//	|ГДЕ
	//				//	|	Организации.Ссылка = &Ссылка";
	//				//	
	//				//	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Организация);
	//				//	
	//				//	РезультатЗапроса = Запрос.Выполнить();
	//				//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//				//	ВыборкаДетальныеЗаписи.Следующий();
	//				//	ДокументОбъект.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.ОсновнойБанковскийСчет;						
	//				//	// ДокументОбъект.СтруктурнаяЕдиница = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета","40802810304060008822");
	//				//Иначе // пока это Москва
	//				//	ДокументОбъект.СтруктурнаяЕдиница = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета","40802810600000027295", ,ДокументОбъект.Организация);
	//				//КонецЕсли;
	//				//// 20220116 1с_dev2 [end]  
	//				
	//				// 20230130, 1c_dev
	//				// стали выписывать счета на ООО ТД Форт с Москвы
	//				// указание Ильи: использовать для ООО ТД Форт основной банковский счет (питерский) не зависимо от региона

	//				// 20230523, 1c_dev, 
	//				// инициатор Баранова Н, согласовано с Черновым И
	//				// 	Надя Баранова попросила выставление счетов с сайта поправить
	//				//	если payment_type_id = 1
	//				// 	то организацию ставить ИП Матусевич, а не ТД Форт как сейчас по умолчанию
	//				
	//				// 20230704, 1c_dev, 
	//				// инициатор Чернов И.Ю., 
	//				// "все, выставление счетов с сайта можно целиком замыкать на ООО ТД Форт,
	//				// больше никаких исключений типа по payment_id или еще каких, нет"
	//				
	//				Если ObjectJSON.order.region = "spb" тогда                        
	//					ДокументОбъект.СтруктурнаяЕдиница = Организация.ОсновнойБанковскийСчет;						
	//				Иначе // пока это Москва
	//					ДокументОбъект.СтруктурнаяЕдиница = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета","40802810600000027295", ,Организация);
	//				КонецЕсли;
	//				
	//				//ДокументОбъект.СуммаВключаетНДС   = Основание.СуммаВключаетНДС; // должно встать в ЗаполнениеДокументов.ЗаполнитьШапкуДокумента()
	//				//ДокументОбъект.СуммаДокумента     = Основание.СуммаДокумента;
	//				ДокументОбъект.ТипЦен             = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойТипЦенПродажи");
	//				
	//				//ДокументОбъект.УчитыватьНДС       = Основание.УчитыватьНДС; // должно встать в ЗаполнениеДокументов.ЗаполнитьШапкуДокумента()
	//				//ДокументОбъект.УсловиеПродаж      = Основание.УсловиеПродаж;
	//				
	//				// products            
	//				Для каждого элемент Из ObjectJSON.order.products Цикл

	//					НоваяСтрока = ДокументОбъект.Товары.Добавить();
	//					
	//					product_id_1c					= Формат(элемент.product_id_1c,"ЧГ=");
	//					КодНоменклатуры 				= Лев("00000000000",Метаданные.Справочники.Номенклатура.ДлинаКода - СтрДлина(product_id_1c)) + product_id_1c;
	//					НоменклатураСсылка 				= Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
	//					Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда 
	//						НоменклатураСсылка	 		= Справочники.Номенклатура.НайтиПоНаименованию("ПустойТовар",Истина);
	//					КонецЕсли;
	//					НоваяСтрока.Номенклатура		= НоменклатураСсылка;
	//					НоваяСтрока.Количество 			= элемент.count;
	//					НоваяСтрока.ЕдиницаИзмерения 	= НоменклатураСсылка.ЕдиницаХраненияОстатков;
	//					НоваяСтрока.Коэффициент 		= НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
	//					НоваяСтрока.СтавкаНДС			= НоменклатураСсылка.СтавкаНДС;
	//					НоваяСтрока.Цена				= элемент.product_price;
	//					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументОбъект);
	//					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументОбъект);
	//					НоваяСтрока.КлючСтроки 			= УправлениеЗапасами.ПолучитьНовыйКлючСтроки(ДокументОбъект);
	//				
	//				КонецЦикла;
	//				
	//				// services
	//				Для каждого элемент Из ObjectJSON.order.services Цикл
	//					
	//					НоваяСтрокаУслуги = ДокументОбъект.Услуги.Добавить(); 
	//					
	//					service_id_1c					= Формат(элемент.service_id_1c,"ЧГ=");
	//					КодНоменклатуры 				= Лев("00000000000",Метаданные.Справочники.Номенклатура.ДлинаКода - СтрДлина(service_id_1c)) + service_id_1c;
	//					НоменклатураСсылка_Услуга 		= Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
	//					Если Не ЗначениеЗаполнено(НоменклатураСсылка_Услуга) Тогда 
	//						НоменклатураСсылка_Услуга	 = Справочники.Номенклатура.НайтиПоНаименованию("ПустойТовар",Истина);
	//					КонецЕсли;
	//					
	//					НоваяСтрокаУслуги.Номенклатура		= НоменклатураСсылка_Услуга;
	//					НоваяСтрокаУслуги.Количество 		= элемент.count;
	//					НоваяСтрокаУслуги.СтавкаНДС			= НоменклатураСсылка_Услуга.СтавкаНДС;
	//					НоваяСтрокаУслуги.Цена				= элемент.service_price;
	//					ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(НоваяСтрокаУслуги,ДокументОбъект);
	//					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрокаУслуги, ДокументОбъект);
	//					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаУслуги, ДокументОбъект);
	//					
	//				КонецЦикла;
	//				
	//				ДокументОбъект.Дата = ТекущаяДата();
	//				ДокументОбъект.УстановитьНовыйНомер();
	//				ДокументОбъект.ОбменДанными.Загрузка = Истина;

	//				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	//				
	//				ЗафиксироватьТранзакцию();
	//				
	//				// Сохранить информацию из order в РС ТДФДанныеЗаказаПокупателяССайта для дальнейшего использования
	//				ДанныеЗаказаПокупателя = ObjectJSON.order;
	//				ХранилищеЗначений = Новый ХранилищеЗначения(ДанныеЗаказаПокупателя);
	//				НоваяЗапись.ЗаказПокупателя = ДокументОбъект.Ссылка;
	//				НоваяЗапись.Данные = ХранилищеЗначений;
	//				НоваяЗапись.Записать();
	//				
	//				//Набор = РегистрыСведений.ТДФДанныеЗаказаПокупателяССайта.СоздатьНаборЗаписей();
	//				//Набор.Отбор.ЗаказПокупателя.Установить(ДокументОбъект.Ссылка);
	//				//Набор.Очистить();
	//				//
	//				//Запись = Набор.Добавить();
	//				//Запись.ЗаказПокупателя = ДокументОбъект.Ссылка;
	//				//Запись.Данные = ХранилищеЗначений;
	//				//
	//				//Набор.Записать();    

	//				// Создать PDF и вернуть в Base64 счет на оплату
	//				order = ObjectJSON.order;
	//				JSONcode_order = Объект1С_в_JSONcode(order);
	//				ДанныеBase64 = tdfort_getRequestForPrint(JSONcode_order);
	//				
	//				ЭлементМассиваCreated = Новый Структура();
	//				ЭлементМассиваCreated.Вставить("type","Request");
	//				ЭлементМассиваCreated.Вставить("tdf_id",ObjectJSON.order.order_id);
	//				ЭлементМассиваCreated.Вставить("_1c_id",ДокументОбъект.Номер);
	//				ЭлементМассиваCreated.Вставить("_1c_type_id"); 
	//				ЭлементМассиваCreated.Вставить("_1c_kind_id");
	//				ЭлементМассиваCreated.Вставить("_1c_year",Год(ДокументОбъект.Дата));
	//				ЭлементМассиваCreated.Вставить("_1c_bill",ДанныеBase64);
	//				CreatedМассив.Добавить(ЭлементМассиваCreated);

	//				MessageТекст = "Успешное создание заказа покупателя";
	//				ОтветСтруктура.Вставить("Result",Истина);		
	//				ОтветСтруктура.Вставить("Message", MessageТекст);
	//				ОтветСтруктура.Вставить("Created", CreatedМассив);
	//
	//			Исключение
	//				
	//				ОтменитьТранзакцию();
	//				ОписаниеОшибки = ОписаниеОшибки();
	//				ЗаписьЖурналаРегистрации("axExchange", УровеньЖурналаРегистрации.Ошибка, , ,"tdfort_createRequest(): " + ОписаниеОшибки);
	//				ОтветСтруктура.Вставить("Result",Ложь);		
	//				ОтветСтруктура.Вставить("Message", "Ошибка времени выполнения");
	//				ОтветСтруктура.Вставить("Created", CreatedМассив);
	//				
	//			КонецПопытки;
	//			
	//		Иначе // не нашлось заказа
	//			
	//			// MessageТекст был сформирован ранее при проверке на существование заказа
	//			ОтветСтруктура.Вставить("Result",Истина);		
	//			ОтветСтруктура.Вставить("Message", MessageТекст);
	//			ОтветСтруктура.Вставить("Created", CreatedМассив);
	//			
	//		КонецЕсли;			
	//		
	//	КонецЕсли;

	//КонецЕсли;
	//
	//JSONcode = Объект1С_в_JSONcode(ОтветСтруктура);
	//
	//Возврат JSONcode;
	
КонецФункции // tdfort_createRequest()

Функция tdfort_createPaymentOrder(JSONcode)
	// Вставить содержимое обработчика.
КонецФункции

// Печатная форма счет на оплату 
// Возврат строка base64
Функция tdfort_getRequestForPrint(JSONcode)
	
	//order = JSONcode_в_Объект1С(JSONcode); 
	//
	//ТДФНомерЗаказаСайт 					= Формат(order.order_id,"ЧГ=");
	//ДлинаРеквизитаТДФНомерЗаказаСайт	= Метаданные.Документы["ЗаказПокупателя"].Реквизиты["ТДФНомерЗаказаСайт"].Тип.КвалификаторыСтроки.Длина;
	//ТДФНомерЗаказаСайт					= Лев("00000000000",ДлинаРеквизитаТДФНомерЗаказаСайт - СтрДлина(ТДФНомерЗаказаСайт)) + ТДФНомерЗаказаСайт;
	//
	//ДокументСсылка = Документы.ЗаказПокупателя.НайтиПоРеквизиту("ТДФНомерЗаказаСайт",ТДФНомерЗаказаСайт); 
	//
	//Если ЗначениеЗаполнено(ДокументСсылка) Тогда
	//	
	//	//ВнешняяОбработка = Справочники.ВнешниеОбработки.НайтиПоКоду("000000062");
	//	//ДвоичныеДанные = ВнешняяОбработка.ХранилищеВнешнейОбработки.Получить();
	//	//АдресФайла = ПолучитьИмяВременногоФайла();
	//	//ДвоичныеДанные.Записать(АдресФайла);
	//	//ПечатнаяФормаОбъект = ВнешниеОбработки.Создать(АдресФайла, Ложь);
	//	//ПечатнаяФормаОбъект.СсылкаНаОбъект = ДокументСсылка;
	//	//
	//	//ТабДок = ПечатнаяФормаОбъект.Печать();
	//	//ТабДок.АвтоМасштаб = Истина;
	//	
	//	ТабДок = ТДФВспомогательный.ПечатьЗаказаПокупателя(ДокументСсылка);
	//	//ТабДок = ТДФВспомогательный.ПечатьЗаказаПокупателяРезервная(ДокументСсылка);		
	//	ТабДок.АвтоМасштаб = Истина;		
	//	
	//	ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
	//	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	//	ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);	
	//	ДанныеBase64 = Base64Строка(ДанныеФайла); 
	//	
	//	Попытка
	//		УдалитьФайлы(ИмяФайла);
	//	Исключение
	//	КонецПопытки;
	//
	//Иначе
	//	ДанныеBase64 = "";	
	//КонецЕсли;
	//
	//Возврат ДанныеBase64; 
	
КонецФункции

Функция tdfort_getSaleForPrint(JSONcode)
	// Вставить содержимое обработчика.
КонецФункции

Функция tdfort_getSchetFacturaForPrint(JSONcode)
	// Вставить содержимое обработчика.
КонецФункции

Функция tdfort_getReconciliationActForPrint(JSONcode)
	// Вставить содержимое обработчика.
КонецФункции

Функция JSONcode_в_Объект1С(JSONcode) 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONcode);
	Объект1С = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат Объект1С; 
	
КонецФункции

Функция Объект1С_в_JSONcode(Объект1С)
	

	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Объект1С);
	JSONcode = ЗаписьJSON.Закрыть();
	
	Возврат JSONcode;
	
КонецФункции

Функция Контрагент_по_ИНН_КПП(ИНН,КПП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	| 	И Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКонтрагент.Следующий() Тогда 
		Возврат ВыборкаКонтрагент.Ссылка;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции	

#КонецОбласти 

#Область СтарыеПроцедурыИФункции

// Поиск объектов в регистре идентификаторов 
//
Функция ПолучитьОбъектПоИдентификатору(Идентификатор, ТипОбъекта, ВидОбъекта)
	
	Возврат Неопределено;
	
КонецФункции

Функция СопоставитьСтатусWMS4_ОжидаемаяПриемка(СтатусWMS4)
	// 2022.03.23 1c_dev2 [start]
	//Если СтатусWMS4 = "Принята" ИЛИ СтатусWMS4 = "Размещена" Тогда
	//	Возврат Перечисления.усСтатусыДокументов.Выполнен;
	Если СтатусWMS4 = "Принята" ИЛИ СтатусWMS4 = "Закрыта" Тогда
		Возврат Перечисления.усСтатусыДокументов.Принят;
	// 2022.03.23 1c_dev2 [end]	
	ИначеЕсли СтатусWMS4 = "Готов к отгрузке" Тогда
		Возврат Перечисления.усСтатусыДокументов.ГотовКОтгрузке;
	ИначеЕсли СтатусWMS4 = "Спланирован частично" ИЛИ СтатусWMS4 = "Спланирован" Тогда
		Возврат Перечисления.усСтатусыДокументов.Выполняется;
	ИначеЕсли СтатусWMS4 = "В работе" ИЛИ СтатусWMS4 = "В отбор" ИЛИ СтатусWMS4 = "В отборе" ИЛИ СтатусWMS4 = "Отобран" ИЛИ СтатусWMS4 = "Упакован" Тогда
		Возврат Перечисления.усСтатусыДокументов.Выполняется;
	ИначеЕсли СтатусWMS4 = "Новая" ИЛИ СтатусWMS4 = "Новый" ИЛИ СтатусWMS4 = "К выполнению" ИЛИ СтатусWMS4 = "К планированию" ИЛИ СтатусWMS4 = "Загружен" Тогда
		Возврат Перечисления.усСтатусыДокументов.Новый;
	// 2022.03.30 1c_dev2 [start]
	// Удалила "Закрыта", т.к. статус Выполнен для Заказа поставщику должен выставляться только когда товар размещен
	// Закрыта - статус документа Приемка, в УТ должен сопоставиться с "Принята"
	// 2022.03.30 1c_dev2 [end]	
	ИначеЕсли СтатусWMS4 = "Завершена" ИЛИ СтатусWMS4 = "Отгружен" ИЛИ СтатусWMS4 = "Размещена" Тогда
		Возврат Перечисления.усСтатусыДокументов.Выполнен;
	ИначеЕсли СтатусWMS4 = "Отменена" ИЛИ СтатусWMS4 = "Отменен" Тогда
		Возврат Перечисления.усСтатусыДокументов.Отменен;
	Иначе
		Возврат Перечисления.усСтатусыДокументов.ВедутсяРаботы;
	КонецЕсли;
	
	// 2022.03.23 1c_dev2
	// Для ожидаемой приемки существуют 4 статуса:
	// К выполнению = Новый
	// В работе     = Выполняется
	// Принята      = Принят
	// Размещена 	= Выполнен - конечная точка со стороны склада
	// + Разгружен - смотрим по дате разгрузки
	
КонецФункции

#КонецОбласти

#КонецОбласти
