&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	ЭлементГруппаОсновное = Элементы.Найти("ГруппаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная", Тип("ГруппаФормы"), ЭлементГруппаОсновное);
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементыУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементыУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементыУС.Видимость = Истина;
	ЭлементыУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементыУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементыУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементыУС.Заголовок = "Отправить в УС";
	ЭлементыУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементТребуетсяДоставка = Элементы
		.Добавить("ax_ЗавозТребуетсяДоставка", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементТребуетсяДоставка.ПутьКДанным = "Объект.ax_ЗавозТребуетсяДоставка";
	ЭлементТребуетсяДоставка.Видимость = Истина;
	ЭлементТребуетсяДоставка.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТребуетсяДоставка.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.Заголовок = "Требуется доставка";
	ЭлементТребуетсяДоставка.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
		
	ЭлементКомментарийСклад = Элементы
		.Добавить("ax_КомментарийСклад", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементКомментарийСклад.ПутьКДанным = "Объект.ax_КомментарийСклад";
	ЭлементКомментарийСклад.Видимость = Истина;
	ЭлементКомментарийСклад.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКомментарийСклад.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.Заголовок = "Комментарий для склада";
	ЭлементКомментарийСклад.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	ЭлементКомментарийСклад.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх; 
	ЭлементКомментарийСклад.РастягиватьПоГоризонтали = Истина;
	ЭлементКомментарийСклад.МногострочныйРежим = Истина;
	ЭлементКомментарийСклад.Ширина = 76;
		
КонецПроцедуры
